-- phpMyAdmin SQL Dump
-- version 4.7.7
-- https://www.phpmyadmin.net/
--
-- Host: localhost:3306
-- Generation Time: Aug 02, 2018 at 04:17 PM
-- Server version: 5.6.38
-- PHP Version: 5.6.32

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `bulk_db`
--

-- --------------------------------------------------------

--
-- Table structure for table `categories`
--

CREATE TABLE `categories` (
  `category_id` int(10) NOT NULL,
  `parent_id` int(10) DEFAULT NULL,
  `path` varchar(255) DEFAULT NULL,
  `name` varchar(255) DEFAULT NULL,
  `slug` varchar(511) DEFAULT NULL,
  `picture` varchar(255) DEFAULT NULL,
  `description` varchar(255) DEFAULT NULL,
  `order` int(10) DEFAULT NULL,
  `status` tinyint(1) DEFAULT '1',
  `deleted_at` datetime DEFAULT NULL,
  `created_by` int(10) DEFAULT NULL,
  `updated_by` int(10) DEFAULT NULL,
  `created_at` datetime DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `categories`
--

INSERT INTO `categories` (`category_id`, `parent_id`, `path`, `name`, `slug`, `picture`, `description`, `order`, `status`, `deleted_at`, `created_by`, `updated_by`, `created_at`, `updated_at`) VALUES
(1, 0, NULL, 'Go green', 'go-green', '/upload/images/category/img_category_01.jpg', NULL, 0, 1, NULL, NULL, 1, NULL, '2018-07-27 03:16:44'),
(2, 0, NULL, 'Agricultural', 'agricultural', '/upload/images/category/img_category_02.jpg', NULL, 0, 1, NULL, NULL, 1, NULL, '2018-07-27 03:22:34'),
(3, 0, NULL, 'Tea', 'tea', '/upload/images/category/img_category_03.jpg', NULL, 0, 1, NULL, NULL, 1, NULL, '2018-07-27 03:22:44'),
(4, 0, NULL, 'Dairy products', 'dairy-products', '/upload/images/category/img_category_04.jpg', NULL, 0, 1, NULL, NULL, 1, NULL, '2018-07-27 03:23:16'),
(5, 0, NULL, 'Seafoods', 'seafoods', '/upload/images/category/img_category_05.jpg', NULL, 0, 1, NULL, NULL, 1, NULL, '2018-07-27 03:23:27'),
(6, 0, NULL, 'Meat & Poultry', 'meat-poultry', '/upload/images/category/img_category_06.jpg', NULL, 0, 1, NULL, NULL, 1, NULL, '2018-07-27 03:23:38');

-- --------------------------------------------------------

--
-- Table structure for table `contacts`
--

CREATE TABLE `contacts` (
  `contact_id` int(10) NOT NULL,
  `name` varchar(255) DEFAULT NULL,
  `email` varchar(255) DEFAULT NULL,
  `phone` varchar(255) DEFAULT NULL,
  `message` varchar(2047) DEFAULT NULL,
  `status` tinyint(1) DEFAULT '0',
  `deleted_at` datetime DEFAULT NULL,
  `created_at` datetime DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `updated_by` int(10) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `contacts`
--

INSERT INTO `contacts` (`contact_id`, `name`, `email`, `phone`, `message`, `status`, `deleted_at`, `created_at`, `updated_at`, `updated_by`) VALUES
(1, 'sdfa asdf', 'fasdfasdf@gamil.com', '23123123', NULL, 0, '2018-07-31 14:30:55', '2018-07-31 10:57:33', '2018-07-31 07:30:55', NULL),
(2, 'fsdfas fasdf', 'asdfasdf@gmail.com', '0909090909', 'das fsdf asdlkfj ldkfjalsdkjfl aksdjflaksdj flaksjdfl;akjsdf asdfasdf', 0, NULL, '2018-07-31 11:05:00', '2018-07-31 04:05:00', NULL),
(3, 'asdfadsfad', 'sfasdfad@gmail.com', '0933848489', 'sadf fadfa sdfasdfas fdasdf', 0, NULL, '2018-07-31 11:10:10', '2018-07-31 04:10:10', NULL),
(4, 'asdfasd fasdfa', 'asdf@gmail.com', '91872981723', 'kaldjfla jladskjfasdf\r\naldkhfalsk dflaksdf\r\nasdfklasdlf sdf', 1, NULL, '2018-07-31 11:12:45', '2018-07-31 07:15:27', 1),
(5, 'dfasd asdfasdf', 'asdfasdf@gmail.com', '21231231', 'dsfa sdfasdfsadf\r\nasdfasdf s\r\nadfasdfasd\r\nfasdfasdfa\r\nsdfasdf', 0, NULL, '2018-07-31 11:16:04', '2018-07-31 04:16:04', NULL),
(6, 'dfas dfasdf', 'asdfasdf@gmail.com', '123123123', 'dfasdf asdfa sdfasa\r\ndfas\r\ndf\r\nasdf\r\nasdf', 0, NULL, '2018-07-31 11:21:24', '2018-07-31 04:21:24', NULL),
(7, 'sdfasd fsd', 'fasdfsadfasd@gmail.com', '2123123123', NULL, 0, NULL, '2018-08-01 10:47:15', '2018-08-01 03:47:15', NULL),
(8, 'sdas fasd fsadfasd', 'dfas@gmail.com', '09273846483', 'ad sdfa df dfasd fkjasdfl jadflka dsfkasljdflaksdjf alksjfalksjdfl kajsdflkajsd;fuaosdiuvasvnasdvasdfasdf', 0, NULL, '2018-08-01 10:50:53', '2018-08-01 03:50:53', NULL),
(9, 'asdf asdf', 'asdf@gmail.com', '0921092809123', 'asdfasdf fasdf', 0, NULL, '2018-08-01 10:52:46', '2018-08-01 03:52:46', NULL),
(10, 'adsf asdfa', 'adfasd@gmail.com', '0917283748', 'kdjlsdfasd dasfadf', 0, NULL, '2018-08-01 10:58:37', '2018-08-01 03:58:37', NULL),
(11, 'asdf adfasdf', 'darkdfjadfhjakdf@gmail.com', '091281729123', 'dfas fasdfasdf', 0, NULL, '2018-08-01 10:59:17', '2018-08-01 03:59:17', NULL),
(12, 'dfasdfasdf', 'dfdfas@gmail.com', '2918231223', 'sdf asdfa dfasdfa df', 0, NULL, '2018-08-01 17:40:32', '2018-08-01 10:40:32', NULL),
(13, 'asdfasdfad', 'adfasdf@gamil.com', '13312312312', NULL, 0, NULL, '2018-08-02 13:35:40', '2018-08-02 06:35:40', NULL);

-- --------------------------------------------------------

--
-- Table structure for table `districts`
--

CREATE TABLE `districts` (
  `district_id` int(11) NOT NULL,
  `province_id` int(11) DEFAULT NULL,
  `name` varchar(255) DEFAULT NULL,
  `type` varchar(255) DEFAULT NULL,
  `location` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `districts`
--

INSERT INTO `districts` (`district_id`, `province_id`, `name`, `type`, `location`) VALUES
(1, 1, 'Ba Đình', 'Quận', '21 02 08N, 105 49 38E'),
(2, 1, 'Hoàn Kiếm', 'Quận', '21 01 53N, 105 51 09E'),
(3, 1, 'Tây Hồ', 'Quận', '21 04 10N, 105 49 07E'),
(4, 1, 'Long Biên', 'Quận', '21 02 21N, 105 53 07E'),
(5, 1, 'Cầu Giấy', 'Quận', '21 01 52N, 105 47 20E'),
(6, 1, 'Đống Đa', 'Quận', '21 00 56N, 105 49 06E'),
(7, 1, 'Hai Bà Trưng', 'Quận', '21 00 27N, 105 51 35E'),
(8, 1, 'Hoàng Mai', 'Quận', '20 58 33N, 105 51 22E'),
(9, 1, 'Thanh Xuân', 'Quận', '20 59 44N, 105 48 56E'),
(10, 1, 'Sóc Sơn', 'Huyện', '21 16 55N, 105 49 46E'),
(11, 1, 'Đông Anh', 'Huyện', '21 08 16N, 105 49 38E'),
(12, 1, 'Gia Lâm', 'Huyện', '21 01 28N, 105 56 54E'),
(13, 1, 'Từ Liêm', 'Huyện', '21 02 39N, 105 45 32E'),
(14, 1, 'Thanh Trì', 'Huyện', '20 56 32N, 105 50 55E'),
(15, 2, 'Hà Giang', 'Thị Xã', '22 46 23N, 105 02 39E'),
(16, 2, 'Đồng Văn', 'Huyện', '23 14 34N, 105 15 48E'),
(17, 2, 'Mèo Vạc', 'Huyện', '23 09 10N, 105 26 38E'),
(18, 2, 'Yên Minh', 'Huyện', '23 04 20N, 105 10 13E'),
(19, 2, 'Quản Bạ', 'Huyện', '23 04 03N, 104 58 05E'),
(20, 2, 'Vị Xuyên', 'Huyện', '22 45 50N, 104 56 26E'),
(21, 2, 'Bắc Mê', 'Huyện', '22 45 48N, 105 16 26E'),
(22, 2, 'Hoàng Su Phì', 'Huyện', '22 41 37N, 104 40 06E'),
(23, 2, 'Xín Mần', 'Huyện', '22 38 05N, 104 28 35E'),
(24, 2, 'Bắc Quang', 'Huyện', '22 23 42N, 104 55 06E'),
(25, 2, 'Quang Bình', 'Huyện', '22 23 07N, 104 37 11E'),
(26, 3, 'Cao Bằng', 'Thị Xã', '22 39 20N, 106 15 20E'),
(27, 3, 'Bảo Lâm', 'Huyện', '22 52 37N, 105 27 28E'),
(28, 3, 'Bảo Lạc', 'Huyện', '22 52 31N, 105 42 41E'),
(29, 3, 'Thông Nông', 'Huyện', '22 49 09N, 105 57 05E'),
(30, 3, 'Hà Quảng', 'Huyện', '22 53 42N, 106 06 32E'),
(31, 3, 'Trà Lĩnh', 'Huyện', '22 48 14N, 106 19 47E'),
(32, 3, 'Trùng Khánh', 'Huyện', '22 49 31N, 106 33 58E'),
(33, 3, 'Hạ Lang', 'Huyện', '22 42 37N, 106 41 42E'),
(34, 3, 'Quảng Uyên', 'Huyện', '22 40 15N, 106 27 42E'),
(35, 3, 'Phục Hoà', 'Huyện', '22 33 52N, 106 30 02E'),
(36, 3, 'Hoà An', 'Huyện', '22 41 20N, 106 02 05E'),
(37, 3, 'Nguyên Bình', 'Huyện', '22 38 52N, 105 57 02E'),
(38, 3, 'Thạch An', 'Huyện', '22 28 51N, 106 19 51E'),
(39, 4, 'Bắc Kạn', 'Thị Xã', '22 08 00N, 105 51 10E'),
(40, 4, 'Pác Nặm', 'Huyện', '22 35 46N, 105 40 25E'),
(41, 4, 'Ba Bể', 'Huyện', '22 23 54N, 105 43 30E'),
(42, 4, 'Ngân Sơn', 'Huyện', '22 25 50N, 106 01 00E'),
(43, 4, 'Bạch Thông', 'Huyện', '22 12 04N, 105 51 01E'),
(44, 4, 'Chợ Đồn', 'Huyện', '22 11 18N, 105 34 43E'),
(45, 4, 'Chợ Mới', 'Huyện', '21 57 56N, 105 51 29E'),
(46, 4, 'Na Rì', 'Huyện', '22 09 48N, 106 05 09E'),
(47, 5, 'Tuyên Quang', 'Thị Xã', '21 49 40N, 105 13 12E'),
(48, 5, 'Nà Hang', 'Huyện', '22 28 34N, 105 21 03E'),
(49, 5, 'Chiêm Hóa', 'Huyện', '22 12 49N, 105 14 32E'),
(50, 5, 'Hàm Yên', 'Huyện', '22 05 46N, 105 00 13E'),
(51, 5, 'Yên Sơn', 'Huyện', '21 51 53N, 105 18 14E'),
(52, 5, 'Sơn Dương', 'Huyện', '21 40 22N, 105 22 57E'),
(53, 6, 'Lào Cai', 'Thành Phố', '22 25 07N, 103 58 43E'),
(54, 6, 'Bát Xát', 'Huyện', '22 35 50N, 103 44 49E'),
(55, 6, 'Mường Khương', 'Huyện', '22 41 05N, 104 08 26E'),
(56, 6, 'Si Ma Cai', 'Huyện', '22 39 46N, 104 16 05E'),
(57, 6, 'Bắc Hà', 'Huyện', '22 30 08N, 104 18 54E'),
(58, 6, 'Bảo Thắng', 'Huyện', '22 22 47N, 104 10 00E'),
(59, 6, 'Bảo Yên', 'Huyện', '22 17 38N, 104 25 02E'),
(60, 6, 'Sa Pa', 'Huyện', '22 18 54N, 103 54 18E'),
(61, 6, 'Văn Bàn', 'Huyện', '22 03 48N, 104 10 59E'),
(62, 7, 'Điện Biên Phủ', 'Thành Phố', '21 24 52N, 103 02 31E'),
(63, 7, 'Mường Lay', 'Thị Xã', '22 01 47N, 103 07 10E'),
(64, 7, 'Mường Nhé', 'Huyện', '22 06 11N, 102 30 54E'),
(65, 7, 'Mường Chà', 'Huyện', '21 50 31N, 103 03 15E'),
(66, 7, 'Tủa Chùa', 'Huyện', '21 58 19N, 103 23 01E'),
(67, 7, 'Tuần Giáo', 'Huyện', '21 38 03N, 103 21 06E'),
(68, 7, 'Điện Biên', 'Huyện', '21 15 19N, 103 03 19E'),
(69, 7, 'Điện Biên Đông', 'Huyện', '21 14 07N, 103 15 19E'),
(70, 7, 'Mường Ảng', 'Huyện', ''),
(71, 8, 'Lai Châu', 'Thị Xã', '22 23 15N, 103 24 22E'),
(72, 8, 'Tam Đường', 'Huyện', '22 20 16N, 103 32 53E'),
(73, 8, 'Mường Tè', 'Huyện', '22 24 16N, 102 43 11E'),
(74, 8, 'Sìn Hồ', 'Huyện', '22 17 21N, 103 18 12E'),
(75, 8, 'Phong Thổ', 'Huyện', '22 38 24N, 103 22 38E'),
(76, 8, 'Than Uyên', 'Huyện', '21 59 35N, 103 45 30E'),
(77, 8, 'Tân Uyên', 'Huyện', ''),
(78, 9, 'Sơn La', 'Thành Phố', '21 20 39N, 103 54 52E'),
(79, 9, 'Quỳnh Nhai', 'Huyện', '21 46 34N, 103 39 02E'),
(80, 9, 'Thuận Châu', 'Huyện', '21 24 54N, 103 39 46E'),
(81, 9, 'Mường La', 'Huyện', '21 31 38N, 104 02 48E'),
(82, 9, 'Bắc Yên', 'Huyện', '21 13 23N, 104 22 09E'),
(83, 9, 'Phù Yên', 'Huyện', '21 13 33N, 104 41 51E'),
(84, 9, 'Mộc Châu', 'Huyện', '20 49 21N, 104 43 10E'),
(85, 9, 'Yên Châu', 'Huyện', '20 59 33N, 104 19 51E'),
(86, 9, 'Mai Sơn', 'Huyện', '21 10 08N, 103 59 36E'),
(87, 9, 'Sông Mã', 'Huyện', '21 06 04N, 103 43 56E'),
(88, 9, 'Sốp Cộp', 'Huyện', '20 52 46N, 103 30 38E'),
(89, 10, 'Yên Bái', 'Thành Phố', '21 44 28N, 104 53 42E'),
(90, 10, 'Nghĩa Lộ', 'Thị Xã', '21 35 58N, 104 29 22E'),
(91, 10, 'Lục Yên', 'Huyện', '22 06 44N, 104 43 12E'),
(92, 10, 'Văn Yên', 'Huyện', '21 55 55N, 104 33 51E'),
(93, 10, 'Mù Cang Chải', 'Huyện', '21 48 22N, 104 09 01E'),
(94, 10, 'Trấn Yên', 'Huyện', '21 42 20N, 104 48 56E'),
(95, 10, 'Trạm Tấu', 'Huyện', '21 30 40N, 104 28 03E'),
(96, 10, 'Văn Chấn', 'Huyện', '21 34 15N, 104 35 19E'),
(97, 10, 'Yên Bình', 'Huyện', '21 52 24N, 104 55 16E'),
(98, 11, 'Hòa Bình', 'Thành Phố', '20 50 36N, 105 19 20E'),
(99, 11, 'Đà Bắc', 'Huyện', '20 55 58N, 105 04 52E'),
(100, 11, 'Kỳ Sơn', 'Huyện', '20 54 06N, 105 23 18E'),
(101, 11, 'Lương Sơn', 'Huyện', '20 53 16N, 105 30 55E'),
(102, 11, 'Kim Bôi', 'Huyện', '20 40 34N, 105 32 15E'),
(103, 11, 'Cao Phong', 'Huyện', '20 41 23N, 105 17 48E'),
(104, 11, 'Tân Lạc', 'Huyện', '20 36 44N, 105 15 03E'),
(105, 11, 'Mai Châu', 'Huyện', '20 40 56N, 104 59 46E'),
(106, 11, 'Lạc Sơn', 'Huyện', '20 29 59N, 105 24 57E'),
(107, 11, 'Yên Thủy', 'Huyện', '20 25 42N, 105 37 59E'),
(108, 11, 'Lạc Thủy', 'Huyện', '20 29 12N, 105 44 06E'),
(109, 12, 'Thái Nguyên', 'Thành Phố', '21 33 20N, 105 48 26E'),
(110, 12, 'Sông Công', 'Thị Xã', '21 29 14N, 105 48 47E'),
(111, 12, 'Định Hóa', 'Huyện', '21 53 50N, 105 38 01E'),
(112, 12, 'Phú Lương', 'Huyện', '21 45 57N, 105 43 22E'),
(113, 12, 'Đồng Hỷ', 'Huyện', '21 41 10N, 105 55 43E'),
(114, 12, 'Võ Nhai', 'Huyện', '21 47 14N, 106 02 29E'),
(115, 12, 'Đại Từ', 'Huyện', '21 36 17N, 105 37 28E'),
(116, 12, 'Phổ Yên', 'Huyện', '21 27 08N, 105 45 19E'),
(117, 12, 'Phú Bình', 'Huyện', '21 29 36N, 105 57 42E'),
(118, 13, 'Lạng Sơn', 'Thành Phố', '21 51 19N, 106 44 50E'),
(119, 13, 'Tràng Định', 'Huyện', '22 18 09N, 106 26 32E'),
(120, 13, 'Bình Gia', 'Huyện', '22 03 56N, 106 19 01E'),
(121, 13, 'Văn Lãng', 'Huyện', '22 01 59N, 106 34 17E'),
(122, 13, 'Cao Lộc', 'Huyện', '21 53 05N, 106 50 34E'),
(123, 13, 'Văn Quan', 'Huyện', '21 51 04N, 106 33 04E'),
(124, 13, 'Bắc Sơn', 'Huyện', '21 48 57N, 106 15 28E'),
(125, 13, 'Hữu Lũng', 'Huyện', '21 34 33N, 106 20 33E'),
(126, 13, 'Chi Lăng', 'Huyện', '21 40 05N, 106 37 24E'),
(127, 13, 'Lộc Bình', 'Huyện', '21 40 41N, 106 58 12E'),
(128, 13, 'Đình Lập', 'Huyện', '21 32 07N, 107 07 25E'),
(129, 14, 'Hạ Long', 'Thành Phố', '20 52 24N, 107 05 23E'),
(130, 14, 'Móng Cái', 'Thành Phố', '21 26 31N, 107 55 09E'),
(131, 14, 'Cẩm Phả', 'Thị Xã', '21 03 42N, 107 17 22E'),
(132, 14, 'Uông Bí', 'Thị Xã', '21 04 33N, 106 45 07E'),
(133, 14, 'Bình Liêu', 'Huyện', '21 33 07N, 107 26 24E'),
(134, 14, 'Tiên Yên', 'Huyện', '21 22 24N, 107 22 50E'),
(135, 14, 'Đầm Hà', 'Huyện', '21 21 23N, 107 34 32E'),
(136, 14, 'Hải Hà', 'Huyện', '21 25 50N, 107 41 26E'),
(137, 14, 'Ba Chẽ', 'Huyện', '21 15 40N, 107 09 52E'),
(138, 14, 'Vân Đồn', 'Huyện', '20 56 17N, 107 28 02E'),
(139, 14, 'Hoành Bồ', 'Huyện', '21 06 30N, 107 02 43E'),
(140, 14, 'Đông Triều', 'Huyện', '21 07 10N, 106 34 36E'),
(141, 14, 'Yên Hưng', 'Huyện', '20 55 40N, 106 51 05E'),
(142, 14, 'Cô Tô', 'Huyện', '21 05 01N, 107 49 10E'),
(143, 15, 'Bắc Giang', 'Thành Phố', '21 17 36N, 106 11 18E'),
(144, 15, 'Yên Thế', 'Huyện', '21 31 29N, 106 09 27E'),
(145, 15, 'Tân Yên', 'Huyện', '21 23 23N, 106 05 55E'),
(146, 15, 'Lạng Giang', 'Huyện', '21 21 58N, 106 15 21E'),
(147, 15, 'Lục Nam', 'Huyện', '21 18 16N, 106 29 24E'),
(148, 15, 'Lục Ngạn', 'Huyện', '21 26 15N, 106 39 09E'),
(149, 15, 'Sơn Động', 'Huyện', '21 19 42N, 106 51 09E'),
(150, 15, 'Yên Dũng', 'Huyện', '21 12 22N, 106 14 12E'),
(151, 15, 'Việt Yên', 'Huyện', '21 16 16N, 106 04 59E'),
(152, 15, 'Hiệp Hòa', 'Huyện', '21 15 51N, 105 57 30E'),
(153, 16, 'Việt Trì', 'Thành Phố', '21 19 01N, 105 23 35E'),
(154, 16, 'Phú Thọ', 'Thị Xã', '21 24 54N, 105 13 46E'),
(155, 16, 'Đoan Hùng', 'Huyện', '21 36 56N, 105 08 42E'),
(156, 16, 'Hạ Hoà', 'Huyện', '21 35 13N, 105 00 22E'),
(157, 16, 'Thanh Ba', 'Huyện', '21 27 04N, 105 09 10E'),
(158, 16, 'Phù Ninh', 'Huyện', '21 26 59N, 105 18 13E'),
(159, 16, 'Yên Lập', 'Huyện', '21 22 21N, 105 01 25E'),
(160, 16, 'Cẩm Khê', 'Huyện', '21 23 04N, 105 05 25E'),
(161, 16, 'Tam Nông', 'Huyện', '21 18 24N, 105 14 59E'),
(162, 16, 'Lâm Thao', 'Huyện', '21 19 37N, 105 18 09E'),
(163, 16, 'Thanh Sơn', 'Huyện', '21 08 32N, 105 04 40E'),
(164, 16, 'Thanh Thuỷ', 'Huyện', '21 07 26N, 105 17 18E'),
(165, 16, 'Tân Sơn', 'Huyện', ''),
(166, 17, 'Vĩnh Yên', 'Thành Phố', '21 18 26N, 105 35 33E'),
(167, 17, 'Phúc Yên', 'Thị Xã', '21 18 55N, 105 43 54E'),
(168, 17, 'Lập Thạch', 'Huyện', '21 24 45N, 105 25 39E'),
(169, 17, 'Tam Dương', 'Huyện', '21 21 40N, 105 33 36E'),
(170, 17, 'Tam Đảo', 'Huyện', '21 27 34N, 105 35 09E'),
(171, 17, 'Bình Xuyên', 'Huyện', '21 19 48N, 105 39 43E'),
(172, 1, 'Mê Linh', 'Huyện', '21 10 53N, 105 42 05E'),
(173, 17, 'Yên Lạc', 'Huyện', '21 13 17N, 105 34 44E'),
(174, 17, 'Vĩnh Tường', 'Huyện', '21 14 58N, 105 29 37E'),
(175, 17, 'Sông Lô', 'Huyện', ''),
(176, 18, 'Bắc Ninh', 'Thành Phố', '21 10 48N, 106 03 58E'),
(177, 18, 'Yên Phong', 'Huyện', '21 12 40N, 105 59 36E'),
(178, 18, 'Quế Võ', 'Huyện', '21 08 44N, 106 11 06E'),
(179, 18, 'Tiên Du', 'Huyện', '21 07 37N, 106 02 19E'),
(180, 18, 'Từ Sơn', 'Thị Xã', '21 07 12N, 105 57 26E'),
(181, 18, 'Thuận Thành', 'Huyện', '21 02 24N, 106 04 10E'),
(182, 18, 'Gia Bình', 'Huyện', '21 03 55N, 106 12 53E'),
(183, 18, 'Lương Tài', 'Huyện', '21 01 33N, 106 13 28E'),
(184, 1, 'Hà Đông', 'Quận', '20 57 25N, 105 45 21E'),
(185, 1, 'Sơn Tây', 'Thị Xã', '21 05 51N, 105 28 27E'),
(186, 1, 'Ba Vì', 'Huyện', '21 09 40N, 105 22 43E'),
(187, 1, 'Phúc Thọ', 'Huyện', '21 06 32N, 105 34 52E'),
(188, 1, 'Đan Phượng', 'Huyện', '21 07 13N, 105 40 49E'),
(189, 1, 'Hoài Đức', 'Huyện', '21 01 25N, 105 42 03E'),
(190, 1, 'Quốc Oai', 'Huyện', '20 58 45N, 105 36 43E'),
(191, 1, 'Thạch Thất', 'Huyện', '21 02 17N, 105 33 05E'),
(192, 1, 'Chương Mỹ', 'Huyện', '20 52 46N, 105 39 01E'),
(193, 1, 'Thanh Oai', 'Huyện', '20 51 44N, 105 46 18E'),
(194, 1, 'Thường Tín', 'Huyện', '20 49 59N, 105 22 19E'),
(195, 1, 'Phú Xuyên', 'Huyện', '20 43 37N, 105 53 43E'),
(196, 1, 'Ứng Hòa', 'Huyện', '20 42 41N, 105 47 58E'),
(197, 1, 'Mỹ Đức', 'Huyện', '20 41 53N, 105 43 31E'),
(198, 19, 'Hải Dương', 'Thành Phố', '20 56 14N, 106 18 21E'),
(199, 19, 'Chí Linh', 'Huyện', '21 07 47N, 106 23 46E'),
(200, 19, 'Nam Sách', 'Huyện', '21 00 15N, 106 20 26E'),
(201, 19, 'Kinh Môn', 'Huyện', '21 00 04N, 106 30 23E'),
(202, 19, 'Kim Thành', 'Huyện', '20 55 40N, 106 30 33E'),
(203, 19, 'Thanh Hà', 'Huyện', '20 53 19N, 106 25 43E'),
(204, 19, 'Cẩm Giàng', 'Huyện', '20 57 05N, 106 12 29E'),
(205, 19, 'Bình Giang', 'Huyện', '20 52 36N, 106 11 24E'),
(206, 19, 'Gia Lộc', 'Huyện', '20 51 01N, 106 17 34E'),
(207, 19, 'Tứ Kỳ', 'Huyện', '20 49 05N, 106 24 05E'),
(208, 19, 'Ninh Giang', 'Huyện', '20 45 13N, 106 20 09E'),
(209, 19, 'Thanh Miện', 'Huyện', '20 46 02N, 106 12 26E'),
(210, 20, 'Hồng Bàng', 'Quận', '20 52 37N, 106 38 32E'),
(211, 20, 'Ngô Quyền', 'Quận', '20 51 13N, 106 41 57E'),
(212, 20, 'Lê Chân', 'Quận', '20 50 12N, 106 40 30E'),
(213, 20, 'Hải An', 'Quận', '20 49 38N, 106 45 57E'),
(214, 20, 'Kiến An', 'Quận', '20 48 26N, 106 38 03E'),
(215, 20, 'Đồ Sơn', 'Quận', '20 42 41N, 106 44 54E'),
(216, 20, 'Kinh Dương', 'Quận', ''),
(217, 20, 'Thuỷ Nguyên', 'Huyện', '20 56 36N, 106 39 38E'),
(218, 20, 'An Dương', 'Huyện', '20 53 06N, 106 35 36E'),
(219, 20, 'An Lão', 'Huyện', '20 47 54N, 106 33 19E'),
(220, 20, 'Kiến Thụy', 'Huyện', '20 45 13N, 106 41 47E'),
(221, 20, 'Tiên Lãng', 'Huyện', '20 42 23N, 106 36 03E'),
(222, 20, 'Vĩnh Bảo', 'Huyện', '20 40 56N, 106 29 57E'),
(223, 20, 'Cát Hải', 'Huyện', '20 47 09N, 106 58 07E'),
(224, 20, 'Bạch Long Vĩ', 'Huyện', '20 08 41N, 107 42 51E'),
(225, 21, 'Hưng Yên', 'Thành Phố', '20 39 38N, 106 03 08E'),
(226, 21, 'Văn Lâm', 'Huyện', '20 58 31N, 106 02 51E'),
(227, 21, 'Văn Giang', 'Huyện', '20 55 51N, 105 57 14E'),
(228, 21, 'Yên Mỹ', 'Huyện', '20 53 45N, 106 01 21E'),
(229, 21, 'Mỹ Hào', 'Huyện', '20 55 35N, 106 05 34E'),
(230, 21, 'Ân Thi', 'Huyện', '20 48 49N, 106 05 30E'),
(231, 21, 'Khoái Châu', 'Huyện', '20 49 53N, 105 58 28E'),
(232, 21, 'Kim Động', 'Huyện', '20 44 47N, 106 01 47E'),
(233, 21, 'Tiên Lữ', 'Huyện', '20 40 05N, 106 07 59E'),
(234, 21, 'Phù Cừ', 'Huyện', '20 42 51N, 106 11 30E'),
(235, 22, 'Thái Bình', 'Thành Phố', '20 26 45N, 106 19 56E'),
(236, 22, 'Quỳnh Phụ', 'Huyện', '20 38 57N, 106 21 16E'),
(237, 22, 'Hưng Hà', 'Huyện', '20 35 38N, 106 12 42E'),
(238, 22, 'Đông Hưng', 'Huyện', '20 32 50N, 106 20 15E'),
(239, 22, 'Thái Thụy', 'Huyện', '20 32 33N, 106 32 32E'),
(240, 22, 'Tiền Hải', 'Huyện', '20 21 05N, 106 32 45E'),
(241, 22, 'Kiến Xương', 'Huyện', '20 23 52N, 106 25 22E'),
(242, 22, 'Vũ Thư', 'Huyện', '20 25 29N, 106 16 43E'),
(243, 23, 'Phủ Lý', 'Thành Phố', '20 32 19N, 105 54 55E'),
(244, 23, 'Duy Tiên', 'Huyện', '20 37 33N, 105 58 01E'),
(245, 23, 'Kim Bảng', 'Huyện', '20 34 19N, 105 50 41E'),
(246, 23, 'Thanh Liêm', 'Huyện', '20 27 31N, 105 55 09E'),
(247, 23, 'Bình Lục', 'Huyện', '20 29 23N, 106 02 52E'),
(248, 23, 'Lý Nhân', 'Huyện', '20 32 55N, 106 04 48E'),
(249, 24, 'Nam Định', 'Thành Phố', '20 25 07N, 106 09 54E'),
(250, 24, 'Mỹ Lộc', 'Huyện', '20 27 21N, 106 07 56E'),
(251, 24, 'Vụ Bản', 'Huyện', '20 22 57N, 106 05 35E'),
(252, 24, 'Ý Yên', 'Huyện', '20 19 48N, 106 01 55E'),
(253, 24, 'Nghĩa Hưng', 'Huyện', '20 05 37N, 106 08 59E'),
(254, 24, 'Nam Trực', 'Huyện', '20 20 08N, 106 12 54E'),
(255, 24, 'Trực Ninh', 'Huyện', '20 14 42N, 106 12 45E'),
(256, 24, 'Xuân Trường', 'Huyện', '20 17 53N, 106 21 43E'),
(257, 24, 'Giao Thủy', 'Huyện', '20 14 45N, 106 28 39E'),
(258, 24, 'Hải Hậu', 'Huyện', '20 06 26N, 106 16 29E'),
(259, 25, 'Ninh Bình', 'Thành Phố', '20 14 45N, 105 58 24E'),
(260, 25, 'Tam Điệp', 'Thị Xã', '20 09 42N, 103 52 43E'),
(261, 25, 'Nho Quan', 'Huyện', '20 18 46N, 105 42 48E'),
(262, 25, 'Gia Viễn', 'Huyện', '20 19 50N, 105 52 20E'),
(263, 25, 'Hoa Lư', 'Huyện', '20 15 04N, 105 55 52E'),
(264, 25, 'Yên Khánh', 'Huyện', '20 11 26N, 106 04 33E'),
(265, 25, 'Kim Sơn', 'Huyện', '20 02 07N, 106 05 27E'),
(266, 25, 'Yên Mô', 'Huyện', '20 07 45N, 105 59 45E'),
(267, 26, 'Thanh Hóa', 'Thành Phố', '19 48 26N, 105 47 37E'),
(268, 26, 'Bỉm Sơn', 'Thị Xã', '20 05 21N, 105 51 48E'),
(269, 26, 'Sầm Sơn', 'Thị Xã', '19 45 11N, 105 54 03E'),
(270, 26, 'Mường Lát', 'Huyện', '20 30 42N, 104 37 27E'),
(271, 26, 'Quan Hóa', 'Huyện', '20 29 15N, 104 56 35E'),
(272, 26, 'Bá Thước', 'Huyện', '20 22 48N, 105 14 50E'),
(273, 26, 'Quan Sơn', 'Huyện', '20 15 17N, 104 51 58E'),
(274, 26, 'Lang Chánh', 'Huyện', '20 08 58N, 105 07 40E'),
(275, 26, 'Ngọc Lặc', 'Huyện', '20 04 08N, 105 22 39E'),
(276, 26, 'Cẩm Thủy', 'Huyện', '20 12 20N, 105 27 22E'),
(277, 26, 'Thạch Thành', 'Huyện', '21 12 41N, 105 36 38E'),
(278, 26, 'Hà Trung', 'Huyện', '20 03 20N, 105 51 20E'),
(279, 26, 'Vĩnh Lộc', 'Huyện', '20 02 29N, 105 39 28E'),
(280, 26, 'Yên Định', 'Huyện', '20 00 31N, 105 37 44E'),
(281, 26, 'Thọ Xuân', 'Huyện', '19 55 39N, 105 29 14E'),
(282, 26, 'Thường Xuân', 'Huyện', '19 54 55N, 105 10 46E'),
(283, 26, 'Triệu Sơn', 'Huyện', '19 48 11N, 105 34 03E'),
(284, 26, 'Thiệu Hoá', 'Huyện', '19 53 56N, 105 40 57E'),
(285, 26, 'Hoằng Hóa', 'Huyện', '19 51 59N, 105 51 34E'),
(286, 26, 'Hậu Lộc', 'Huyện', '19 56 02N, 105 53 19E'),
(287, 26, 'Nga Sơn', 'Huyện', '20 00 16N, 105 59 26E'),
(288, 26, 'Như Xuân', 'Huyện', '19 5 55N, 105 20 22E'),
(289, 26, 'Như Thanh', 'Huyện', '19 35 19N, 105 33 09E'),
(290, 26, 'Nông Cống', 'Huyện', '19 36 58N, 105 40 54E'),
(291, 26, 'Đông Sơn', 'Huyện', '19 47 44N, 105 42 19E'),
(292, 26, 'Quảng Xương', 'Huyện', '19 40 53N, 105 48 01E'),
(293, 26, 'Tĩnh Gia', 'Huyện', '19 27 13N, 105 43 38E'),
(294, 27, 'Vinh', 'Thành Phố', '18 41 06N, 105 42 05E'),
(295, 27, 'Cửa Lò', 'Thị Xã', '18 47 26N, 105 43 31E'),
(296, 27, 'Thái Hoà', 'Thị Xã', ''),
(297, 27, 'Quế Phong', 'Huyện', '19 42 25N, 104 54 21E'),
(298, 27, 'Quỳ Châu', 'Huyện', '19 32 16N, 105 03 18E'),
(299, 27, 'Kỳ Sơn', 'Huyện', '19 24 36N, 104 09 45E'),
(300, 27, 'Tương Dương', 'Huyện', '19 19 15N, 104 35 41E'),
(301, 27, 'Nghĩa Đàn', 'Huyện', '19 21 19N, 105 26 33E'),
(302, 27, 'Quỳ Hợp', 'Huyện', '19 19 24N, 105 09 12E'),
(303, 27, 'Quỳnh Lưu', 'Huyện', '19 14 01N, 105 37 00E'),
(304, 27, 'Con Cuông', 'Huyện', '19 03 50N, 107 47 15E'),
(305, 27, 'Tân Kỳ', 'Huyện', '19 06 11N, 105 14 14E'),
(306, 27, 'Anh Sơn', 'Huyện', '18 58 04N, 105 04 30E'),
(307, 27, 'Diễn Châu', 'Huyện', '19 01 20N, 105 34 13E'),
(308, 27, 'Yên Thành', 'Huyện', '19 01 25N, 105 26 17E'),
(309, 27, 'Đô Lương', 'Huyện', '18 55 00N, 105 21 03E'),
(310, 27, 'Thanh Chương', 'Huyện', '18 44 11N, 105 12 59E'),
(311, 27, 'Nghi Lộc', 'Huyện', '18 47 41N, 105 31 30E'),
(312, 27, 'Nam Đàn', 'Huyện', '18 40 28N, 105 30 32E'),
(313, 27, 'Hưng Nguyên', 'Huyện', '18 41 13N, 105 37 41E'),
(314, 28, 'Hà Tĩnh', 'Thành Phố', '18 21 20N, 105 54 00E'),
(315, 28, 'Hồng Lĩnh', 'Thị Xã', '18 32 05N, 105 42 40E'),
(316, 28, 'Hương Sơn', 'Huyện', '18 26 47N, 105 19 36E'),
(317, 28, 'Đức Thọ', 'Huyện', '18 29 23N, 105 36 39E'),
(318, 28, 'Vũ Quang', 'Huyện', '18 19 30N, 105 26 38E'),
(319, 28, 'Nghi Xuân', 'Huyện', '18 38 46N, 105 46 17E'),
(320, 28, 'Can Lộc', 'Huyện', '18 26 39N, 105 46 13E'),
(321, 28, 'Hương Khê', 'Huyện', '18 11 36N, 105 41 24E'),
(322, 28, 'Thạch Hà', 'Huyện', '18 19 29N, 105 52 43E'),
(323, 28, 'Cẩm Xuyên', 'Huyện', '18 11 32N, 106 00 04E'),
(324, 28, 'Kỳ Anh', 'Huyện', '18 05 15N, 106 15 49E'),
(325, 28, 'Lộc Hà', 'Huyện', ''),
(326, 29, 'Đồng Hới', 'Thành Phố', '17 26 53N, 106 35 15E'),
(327, 29, 'Minh Hóa', 'Huyện', '17 44 03N, 105 51 45E'),
(328, 29, 'Tuyên Hóa', 'Huyện', '17 54 04N, 105 58 17E'),
(329, 29, 'Quảng Trạch', 'Huyện', '17 50 04N, 106 22 24E'),
(330, 29, 'Bố Trạch', 'Huyện', '17 29 13N, 106 06 54E'),
(331, 29, 'Quảng Ninh', 'Huyện', '17 15 15N, 106 32 31E'),
(332, 29, 'Lệ Thủy', 'Huyện', '17 07 35N, 106 41 47E'),
(333, 30, 'Đông Hà', 'Thành Phố', '16 48 12N, 107 05 12E'),
(334, 30, 'Quảng Trị', 'Thị Xã', '16 44 37N, 107 11 20E'),
(335, 30, 'Vĩnh Linh', 'Huyện', '17 01 35N, 106 53 49E'),
(336, 30, 'Hướng Hóa', 'Huyện', '16 42 19N, 106 40 14E'),
(337, 30, 'Gio Linh', 'Huyện', '16 54 49N, 106 56 16E'),
(338, 30, 'Đa Krông', 'Huyện', '16 33 58N, 106 55 49E'),
(339, 30, 'Cam Lộ', 'Huyện', '16 47 09N, 106 57 52E'),
(340, 30, 'Triệu Phong', 'Huyện', '16 46 32N, 107 09 12E'),
(341, 30, 'Hải Lăng', 'Huyện', '16 41 07N, 107 13 34E'),
(342, 30, 'Cồn Cỏ', 'Huyện', '19 09 39N, 107 19 58E'),
(343, 31, 'Huế', 'Thành Phố', '16 27 16N, 107 34 29E'),
(344, 31, 'Phong Điền', 'Huyện', '16 32 42N, 106 16 37E'),
(345, 31, 'Quảng Điền', 'Huyện', '16 35 21N, 107 29 31E'),
(346, 31, 'Phú Vang', 'Huyện', '16 27 20N, 107 42 28E'),
(347, 31, 'Hương Thủy', 'Huyện', '16 19 27N, 107 37 26E'),
(348, 31, 'Hương Trà', 'Huyện', '16 25 49N, 107 28 37E'),
(349, 31, 'A Lưới', 'Huyện', '16 13 59N, 107 16 12E'),
(350, 31, 'Phú Lộc', 'Huyện', '16 17 16N, 107 55 25E'),
(351, 31, 'Nam Đông', 'Huyện', '16 07 11N, 107 41 25E'),
(352, 32, 'Liên Chiểu', 'Quận', '16 07 26N, 108 07 04E'),
(353, 32, 'Thanh Khê', 'Quận', '16 03 28N, 108 11 00E'),
(354, 32, 'Hải Châu', 'Quận', '16 03 38N, 108 11 46E'),
(355, 32, 'Sơn Trà', 'Quận', '16 06 13N, 108 16 26E'),
(356, 32, 'Ngũ Hành Sơn', 'Quận', '16 00 30N, 108 15 09E'),
(357, 32, 'Cẩm Lệ', 'Quận', ''),
(358, 32, 'Hoà Vang', 'Huyện', '16 03 59N, 108 01 57E'),
(359, 32, 'Hoàng Sa', 'Huyện', '16 21 36N, 111 57 01E'),
(360, 33, 'Tam Kỳ', 'Thành Phố', '15 34 37N, 108 29 52E'),
(361, 33, 'Hội An', 'Thành Phố', '15 53 20N, 108 20 42E'),
(362, 33, 'Tây Giang', 'Huyện', '15 53 46N, 107 25 52E'),
(363, 33, 'Đông Giang', 'Huyện', '15 54 44N, 107 47 06E'),
(364, 33, 'Đại Lộc', 'Huyện', '15 50 10N, 107 58 27E'),
(365, 33, 'Điện Bàn', 'Huyện', '15 54 15N, 108 13 38E'),
(366, 33, 'Duy Xuyên', 'Huyện', '15 47 58N, 108 13 27E'),
(367, 33, 'Quế Sơn', 'Huyện', '15 41 03N, 108 05 34E'),
(368, 33, 'Nam Giang', 'Huyện', '15 36 37N, 107 33 52E'),
(369, 33, 'Phước Sơn', 'Huyện', '15 23 17N, 107 50 22E'),
(370, 33, 'Hiệp Đức', 'Huyện', '15 31 09N, 108 05 56E'),
(371, 33, 'Thăng Bình', 'Huyện', '15 42 29N, 108 22 04E'),
(372, 33, 'Tiên Phước', 'Huyện', '15 29 30N, 108 15 28E'),
(373, 33, 'Bắc Trà My', 'Huyện', '15 08 00N, 108 05 32E'),
(374, 33, 'Nam Trà My', 'Huyện', '15 16 40N, 108 12 15E'),
(375, 33, 'Núi Thành', 'Huyện', '15 26 53N, 108 34 49E'),
(376, 33, 'Phú Ninh', 'Huyện', '15 30 43N, 108 24 43E'),
(377, 33, 'Nông Sơn', 'Huyện', ''),
(378, 34, 'Quảng Ngãi', 'Thành Phố', '15 07 17N, 108 48 24E'),
(379, 34, 'Bình Sơn', 'Huyện', '15 18 45N, 108 45 35E'),
(380, 34, 'Trà Bồng', 'Huyện', '15 13 30N, 108 29 57E'),
(381, 34, 'Tây Trà', 'Huyện', '15 11 13N, 108 22 23E'),
(382, 34, 'Sơn Tịnh', 'Huyện', '15 11 49N, 108 45 03E'),
(383, 34, 'Tư Nghĩa', 'Huyện', '15 05 25N, 108 45 23E'),
(384, 34, 'Sơn Hà', 'Huyện', '14 58 35N, 108 29 09E'),
(385, 34, 'Sơn Tây', 'Huyện', '14 58 11N, 108 21 22E'),
(386, 34, 'Minh Long', 'Huyện', '14 56 49N, 108 40 19E'),
(387, 34, 'Nghĩa Hành', 'Huyện', '14 58 06N, 108 46 05E'),
(388, 34, 'Mộ Đức', 'Huyện', '11 59 13N, 108 52 21E'),
(389, 34, 'Đức Phổ', 'Huyện', '14 44 59N, 108 56 58E'),
(390, 34, 'Ba Tơ', 'Huyện', '14 42 52N, 108 43 44E'),
(391, 34, 'Lý Sơn', 'Huyện', '15 22 50N, 109 06 56E'),
(392, 35, 'Qui Nhơn', 'Thành Phố', '13 47 15N, 109 12 48E'),
(393, 35, 'An Lão', 'Huyện', '14 32 10N, 108 47 52E'),
(394, 35, 'Hoài Nhơn', 'Huyện', '14 30 56N, 109 01 56E'),
(395, 35, 'Hoài Ân', 'Huyện', '14 20 51N, 108 54 04E'),
(396, 35, 'Phù Mỹ', 'Huyện', '14 14 41N, 109 05 43E'),
(397, 35, 'Vĩnh Thạnh', 'Huyện', '14 14 26N, 108 44 08E'),
(398, 35, 'Tây Sơn', 'Huyện', '13 56 47N, 108 53 06E'),
(399, 35, 'Phù Cát', 'Huyện', '14 03 48N, 109 03 57E'),
(400, 35, 'An Nhơn', 'Huyện', '13 51 28N, 109 04 02E'),
(401, 35, 'Tuy Phước', 'Huyện', '13 46 30N, 109 05 38E'),
(402, 35, 'Vân Canh', 'Huyện', '13 40 35N, 108 57 52E'),
(403, 36, 'Tuy Hòa', 'Thành Phố', '13 05 42N, 109 15 50E'),
(404, 36, 'Sông Cầu', 'Thị Xã', '13 31 40N, 109 12 39E'),
(405, 36, 'Đồng Xuân', 'Huyện', '13 24 59N, 108 56 46E'),
(406, 36, 'Tuy An', 'Huyện', '13 15 19N, 109 12 21E'),
(407, 36, 'Sơn Hòa', 'Huyện', '13 12 16N, 108 57 17E'),
(408, 36, 'Sông Hinh', 'Huyện', '12 54 19N, 108 53 38E'),
(409, 36, 'Tây Hoà', 'Huyện', ''),
(410, 36, 'Phú Hoà', 'Huyện', '13 04 07N, 109 11 24E'),
(411, 36, 'Đông Hoà', 'Huyện', ''),
(412, 37, 'Nha Trang', 'Thành Phố', '12 15 40N, 109 10 40E'),
(413, 37, 'Cam Ranh', 'Thị Xã', '11 59 05N, 108 08 17E'),
(414, 37, 'Cam Lâm', 'Huyện', ''),
(415, 37, 'Vạn Ninh', 'Huyện', '12 43 10N, 109 11 18E'),
(416, 37, 'Ninh Hòa', 'Huyện', '12 32 54N, 109 06 11E'),
(417, 37, 'Khánh Vĩnh', 'Huyện', '12 17 50N, 108 51 56E'),
(418, 37, 'Diên Khánh', 'Huyện', '12 13 19N, 109 02 16E'),
(419, 37, 'Khánh Sơn', 'Huyện', '12 02 17N, 108 53 47E'),
(420, 37, 'Trường Sa', 'Huyện', '9 07 27N, 114 15 00E'),
(421, 38, 'Phan Rang-Tháp Chàm', 'Thành Phố', '11 36 11N, 108 58 34E'),
(422, 38, 'Bác Ái', 'Huyện', '11 54 45N, 108 51 29E'),
(423, 38, 'Ninh Sơn', 'Huyện', '11 42 36N, 108 44 55E'),
(424, 38, 'Ninh Hải', 'Huyện', '11 42 46N, 109 05 41E'),
(425, 38, 'Ninh Phước', 'Huyện', '11 28 56N, 108 50 34E'),
(426, 38, 'Thuận Bắc', 'Huyện', ''),
(427, 38, 'Thuận Nam', 'Huyện', ''),
(428, 39, 'Phan Thiết', 'Thành Phố', '10 54 16N, 108 03 44E'),
(429, 39, 'La Gi', 'Thị Xã', ''),
(430, 39, 'Tuy Phong', 'Huyện', '11 20 26N, 108 41 15E'),
(431, 39, 'Bắc Bình', 'Huyện', '11 15 52N, 108 21 33E'),
(432, 39, 'Hàm Thuận Bắc', 'Huyện', '11 09 18N, 108 03 07E'),
(433, 39, 'Hàm Thuận Nam', 'Huyện', '10 56 20N, 107 54 38E'),
(434, 39, 'Tánh Linh', 'Huyện', '11 08 26N, 107 41 22E'),
(435, 39, 'Đức Linh', 'Huyện', '11 11 43N, 107 31 34E'),
(436, 39, 'Hàm Tân', 'Huyện', '10 44 41N, 107 41 33E'),
(437, 39, 'Phú Quí', 'Huyện', '10 33 13N, 108 57 46E'),
(438, 40, 'Kon Tum', 'Thành Phố', '14 20 32N, 107 58 04E'),
(439, 40, 'Đắk Glei', 'Huyện', '15 08 13N, 107 44 03E'),
(440, 40, 'Ngọc Hồi', 'Huyện', '14 44 23N, 107 38 49E'),
(441, 40, 'Đắk Tô', 'Huyện', '14 46 49N, 107 55 36E'),
(442, 40, 'Kon Plông', 'Huyện', '14 48 13N, 108 20 05E'),
(443, 40, 'Kon Rẫy', 'Huyện', '14 32 56N, 108 13 09E'),
(444, 40, 'Đắk Hà', 'Huyện', '14 36 50N, 107 59 55E'),
(445, 40, 'Sa Thầy', 'Huyện', '14 16 02N, 107 36 30E'),
(446, 40, 'Tu Mơ Rông', 'Huyện', ''),
(447, 41, 'Pleiku', 'Thành Phố', '13 57 42N, 107 58 03E'),
(448, 41, 'An Khê', 'Thị Xã', '14 01 24N, 108 41 29E'),
(449, 41, 'Ayun Pa', 'Thị Xã', ''),
(450, 41, 'Kbang', 'Huyện', '14 18 08N, 108 29 17E'),
(451, 41, 'Đăk Đoa', 'Huyện', '14 07 02N, 108 09 36E'),
(452, 41, 'Chư Păh', 'Huyện', '14 13 30N, 107 56 33E'),
(453, 41, 'Ia Grai', 'Huyện', '13 59 25N, 107 43 16E'),
(454, 41, 'Mang Yang', 'Huyện', '13 57 26N, 108 18 37E'),
(455, 41, 'Kông Chro', 'Huyện', '13 45 47N, 108 36 04E'),
(456, 41, 'Đức Cơ', 'Huyện', '13 46 16N, 107 38 26E'),
(457, 41, 'Chư Prông', 'Huyện', '13 35 39N, 107 47 36E'),
(458, 41, 'Chư Sê', 'Huyện', '13 37 04N, 108 06 56E'),
(459, 41, 'Đăk Pơ', 'Huyện', '13 55 47N, 108 36 16E'),
(460, 41, 'Ia Pa', 'Huyện', '13 31 37N, 108 30 34E'),
(461, 41, 'Krông Pa', 'Huyện', '13 14 13N, 108 39 12E'),
(462, 41, 'Phú Thiện', 'Huyện', ''),
(463, 41, 'Chư Pưh', 'Huyện', ''),
(464, 42, 'Buôn Ma Thuột', 'Thành Phố', '12 39 43N, 108 10 40E'),
(465, 42, 'Buôn Hồ', 'Thị Xã', ''),
(466, 42, 'Ea H\'leo', 'Huyện', '13 13 52N, 108 12 30E'),
(467, 42, 'Ea Súp', 'Huyện', '13 10 59N, 107 46 49E'),
(468, 42, 'Buôn Đôn', 'Huyện', '12 52 45N, 107 45 20E'),
(469, 42, 'Cư M\'gar', 'Huyện', '12 53 47N, 108 04 16E'),
(470, 42, 'Krông Búk', 'Huyện', '12 56 27N, 108 13 54E'),
(471, 42, 'Krông Năng', 'Huyện', '12 59 41N, 108 23 42E'),
(472, 42, 'Ea Kar', 'Huyện', '12 48 17N, 108 32 42E'),
(473, 42, 'M\'đrắk', 'Huyện', '12 42 14N, 108 47 09E'),
(474, 42, 'Krông Bông', 'Huyện', '12 27 08N, 108 27 01E'),
(475, 42, 'Krông Pắc', 'Huyện', '12 41 20N, 108 18 42E'),
(476, 42, 'Krông A Na', 'Huyện', '12 31 51N, 108 05 03E'),
(477, 42, 'Lắk', 'Huyện', '12 19 20N, 108 12 17E'),
(478, 42, 'Cư Kuin', 'Huyện', ''),
(479, 43, 'Gia Nghĩa', 'Thị Xã', ''),
(480, 43, 'Đắk Glong', 'Huyện', '12 01 53N, 107 50 37E'),
(481, 43, 'Cư Jút', 'Huyện', '12 40 56N, 107 44 44E'),
(482, 43, 'Đắk Mil', 'Huyện', '12 31 08N, 107 42 24E'),
(483, 43, 'Krông Nô', 'Huyện', '12 22 16N, 107 53 49E'),
(484, 43, 'Đắk Song', 'Huyện', '12 14 04N, 107 36 30E'),
(485, 43, 'Đắk R\'lấp', 'Huyện', '12 02 30N, 107 25 59E'),
(486, 43, 'Tuy Đức', 'Huyện', ''),
(487, 44, 'Đà Lạt', 'Thành Phố', '11 54 33N, 108 27 08E'),
(488, 44, 'Bảo Lộc', 'Thị Xã', '11 32 48N, 107 47 37E'),
(489, 44, 'Đam Rông', 'Huyện', '12 02 35N, 108 10 26E'),
(490, 44, 'Lạc Dương', 'Huyện', '12 08 30N, 108 27 48E'),
(491, 44, 'Lâm Hà', 'Huyện', '11 55 26N, 108 11 31E'),
(492, 44, 'Đơn Dương', 'Huyện', '11 48 26N, 108 32 48E'),
(493, 44, 'Đức Trọng', 'Huyện', '11 41 50N, 108 18 58E'),
(494, 44, 'Di Linh', 'Huyện', '11 31 10N, 108 05 23E'),
(495, 44, 'Bảo Lâm', 'Huyện', '11 38 31N, 107 43 25E'),
(496, 44, 'Đạ Huoai', 'Huyện', '11 27 11N, 107 38 08E'),
(497, 44, 'Đạ Tẻh', 'Huyện', '11 33 46N, 107 32 00E'),
(498, 44, 'Cát Tiên', 'Huyện', '11 39 38N, 107 23 27E'),
(499, 45, 'Phước Long', 'Thị Xã', ''),
(500, 45, 'Đồng Xoài', 'Thị Xã', '11 31 01N, 106 50 21E'),
(501, 45, 'Bình Long', 'Thị Xã', ''),
(502, 45, 'Bù Gia Mập', 'Huyện', '11 56 57N, 106 59 21E'),
(503, 45, 'Lộc Ninh', 'Huyện', '11 49 28N, 106 35 11E'),
(504, 45, 'Bù Đốp', 'Huyện', '11 59 08N, 106 49 54E'),
(505, 45, 'Hớn Quản', 'Huyện', '11 37 37N, 106 36 02E'),
(506, 45, 'Đồng Phù', 'Huyện', '11 28 45N, 106 57 07E'),
(507, 45, 'Bù Đăng', 'Huyện', '11 46 09N, 107 14 14E'),
(508, 45, 'Chơn Thành', 'Huyện', '11 28 45N, 106 39 26E'),
(509, 46, 'Tây Ninh', 'Thị Xã', '11 21 59N, 106 07 47E'),
(510, 46, 'Tân Biên', 'Huyện', '11 35 14N, 105 57 53E'),
(511, 46, 'Tân Châu', 'Huyện', '11 34 49N, 106 17 48E'),
(512, 46, 'Dương Minh Châu', 'Huyện', '11 22 04N, 106 16 58E'),
(513, 46, 'Châu Thành', 'Huyện', '11 19 02N, 106 00 15E'),
(514, 46, 'Hòa Thành', 'Huyện', '11 15 31N, 106 08 44E'),
(515, 46, 'Gò Dầu', 'Huyện', '11 09 39N, 106 14 42E'),
(516, 46, 'Bến Cầu', 'Huyện', '11 07 50N, 106 08 25E'),
(517, 46, 'Trảng Bàng', 'Huyện', '11 06 18N, 106 23 12E'),
(518, 47, 'Thủ Dầu Một', 'Thị Xã', '11 00 01N, 106 38 56E'),
(519, 47, 'Dầu Tiếng', 'Huyện', '11 19 07N, 106 26 59E'),
(520, 47, 'Bến Cát', 'Huyện', '11 12 42N, 106 36 28E'),
(521, 47, 'Phú Giáo', 'Huyện', '11 20 21N, 106 47 48E'),
(522, 47, 'Tân Uyên', 'Huyện', '11 06 31N, 106 49 02E'),
(523, 47, 'Dĩ An', 'Huyện', '10 55 03N, 106 47 09E'),
(524, 47, 'Thuận An', 'Huyện', '10 55 58N, 106 41 59E'),
(525, 48, 'Biên Hòa', 'Thành Phố', '10 56 31N, 106 50 50E'),
(526, 48, 'Long Khánh', 'Thị Xã', '10 56 24N, 107 14 29E'),
(527, 48, 'Tân Phú', 'Huyện', '11 22 51N, 107 21 35E'),
(528, 48, 'Vĩnh Cửu', 'Huyện', '11 14 31N, 107 00 06E'),
(529, 48, 'Định Quán', 'Huyện', '11 12 41N, 107 17 03E'),
(530, 48, 'Trảng Bom', 'Huyện', '10 58 39N, 107 00 52E'),
(531, 48, 'Thống Nhất', 'Huyện', '10 58 29N, 107 09 26E'),
(532, 48, 'Cẩm Mỹ', 'Huyện', '10 47 05N, 107 14 36E'),
(533, 48, 'Long Thành', 'Huyện', '10 47 38N, 106 59 42E'),
(534, 48, 'Xuân Lộc', 'Huyện', '10 55 39N, 107 24 21E'),
(535, 48, 'Nhơn Trạch', 'Huyện', '10 39 18N, 106 53 18E'),
(536, 49, 'Vũng Tầu', 'Thành Phố', '10 24 08N, 107 07 05E'),
(537, 49, 'Bà Rịa', 'Thị Xã', '10 30 33N, 107 10 47E'),
(538, 49, 'Châu Đức', 'Huyện', '10 39 23N, 107 15 08E'),
(539, 49, 'Xuyên Mộc', 'Huyện', '10 37 46N, 107 29 39E'),
(540, 49, 'Long Điền', 'Huyện', '10 26 47N, 107 12 53E'),
(541, 49, 'Đất Đỏ', 'Huyện', '10 28 40N, 107 18 27E'),
(542, 49, 'Tân Thành', 'Huyện', '10 34 50N, 107 05 06E'),
(543, 49, 'Côn Đảo', 'Huyện', '8 42 25N, 106 36 05E'),
(544, 50, '1', 'Quận', '10 46 34N, 106 41 45E'),
(545, 50, '12', 'Quận', '10 51 43N, 106 39 32E'),
(546, 50, 'Thủ Đức', 'Quận', '10 51 20N, 106 45 05E'),
(547, 50, '9', 'Quận', '10 49 49N, 106 49 03E'),
(548, 50, 'Gò Vấp', 'Quận', '10 50 12N, 106 39 52E'),
(549, 50, 'Bình Thạnh', 'Quận', '10 48 46N, 106 42 57E'),
(550, 50, 'Tân Bình', 'Quận', '10 48 13N, 106 39 03E'),
(551, 50, 'Tân Phú', 'Quận', '10 47 32N, 106 37 31E'),
(552, 50, 'Phú Nhuận', 'Quận', '10 48 06N, 106 40 39E'),
(553, 50, '2', 'Quận', '10 46 51N, 106 45 25E'),
(554, 50, '3', 'Quận', '10 46 48N, 106 40 46E'),
(555, 50, '10', 'Quận', '10 46 25N, 106 40 02E'),
(556, 50, '11', 'Quận', '10 46 01N, 106 38 44E'),
(557, 50, '4', 'Quận', '10 45 42N, 106 42 09E'),
(558, 50, '5', 'Quận', '10 45 24N, 106 40 00E'),
(559, 50, '6', 'Quận', '10 44 46N, 106 38 10E'),
(560, 50, '8', 'Quận', '10 43 24N, 106 37 40E'),
(561, 50, 'Bình Tân', 'Quận', '10 46 16N, 106 35 26E'),
(562, 50, '7', 'Quận', '10 44 19N, 106 43 35E'),
(563, 50, 'Củ Chi', 'Huyện', '11 02 17N, 106 30 20E'),
(564, 50, 'Hóc Môn', 'Huyện', '10 52 42N, 106 35 33E'),
(565, 50, 'Bình Chánh', 'Huyện', '10 45 01N, 106 30 45E'),
(566, 50, 'Nhà Bè', 'Huyện', '10 39 06N, 106 43 35E'),
(567, 50, 'Cần Giờ', 'Huyện', '10 30 43N, 106 52 50E'),
(568, 51, 'Tân An', 'Thành Phố', '10 31 36N, 106 24 06E'),
(569, 51, 'Tân Hưng', 'Huyện', '10 49 05N, 105 39 26E'),
(570, 51, 'Vĩnh Hưng', 'Huyện', '10 52 54N, 105 45 58E'),
(571, 51, 'Mộc Hóa', 'Huyện', '10 47 09N, 105 57 56E'),
(572, 51, 'Tân Thạnh', 'Huyện', '10 37 44N, 105 57 07E'),
(573, 51, 'Thạnh Hóa', 'Huyện', '10 41 37N, 106 11 08E'),
(574, 51, 'Đức Huệ', 'Huyện', '10 51 57N, 106 15 48E'),
(575, 51, 'Đức Hòa', 'Huyện', '10 53 04N, 106 23 58E'),
(576, 51, 'Bến Lức', 'Huyện', '10 41 40N, 106 26 28E'),
(577, 51, 'Thủ Thừa', 'Huyện', '10 39 41N, 106 20 12E'),
(578, 51, 'Tân Trụ', 'Huyện', '10 31 47N, 106 30 06E'),
(579, 51, 'Cần Đước', 'Huyện', '10 32 21N, 106 36 33E'),
(580, 51, 'Cần Giuộc', 'Huyện', '10 34 43N, 106 38 35E'),
(581, 51, 'Châu Thành', 'Huyện', '10 27 52N, 106 30 00E'),
(582, 52, 'Mỹ Tho', 'Thành Phố', '10 22 14N, 106 21 52E'),
(583, 52, 'Gò Công', 'Thị Xã', '10 21 55N, 106 40 24E'),
(584, 52, 'Tân Phước', 'Huyện', '10 30 36N, 106 13 02E'),
(585, 52, 'Cái Bè', 'Huyện', '10 24 21N, 105 56 01E'),
(586, 52, 'Cai Lậy', 'Huyện', '10 24 20N, 106 06 05E'),
(587, 52, 'Châu Thành', 'Huyện', '20 25 21N, 106 16 57E'),
(588, 52, 'Chợ Gạo', 'Huyện', '10 23 45N, 106 26 53E'),
(589, 52, 'Gò Công Tây', 'Huyện', '10 19 55N, 106 35 02E'),
(590, 52, 'Gò Công Đông', 'Huyện', '10 20 42N, 106 42 54E'),
(591, 52, 'Tân Phú Đông', 'Huyện', ''),
(592, 53, 'Bến Tre', 'Thành Phố', '10 14 17N, 106 22 26E'),
(593, 53, 'Châu Thành', 'Huyện', '10 17 24N, 106 17 45E'),
(594, 53, 'Chợ Lách', 'Huyện', '10 13 26N, 106 09 08E'),
(595, 53, 'Mỏ Cày Nam', 'Huyện', '10 06 56N, 106 19 40E'),
(596, 53, 'Giồng Trôm', 'Huyện', '10 08 46N, 106 28 12E'),
(597, 53, 'Bình Đại', 'Huyện', '10 09 56N, 106 37 46E'),
(598, 53, 'Ba Tri', 'Huyện', '10 04 08N, 106 35 10E'),
(599, 53, 'Thạnh Phú', 'Huyện', '9 55 53N, 106 32 45E'),
(600, 53, 'Mỏ Cày Bắc', 'Huyện', ''),
(601, 54, 'Trà Vinh', 'Thị Xã', '9 57 09N, 106 20 39E'),
(602, 54, 'Càng Long', 'Huyện', '9 58 18N, 106 12 52E'),
(603, 54, 'Cầu Kè', 'Huyện', '9 51 23N, 106 03 33E'),
(604, 54, 'Tiểu Cần', 'Huyện', '9 48 37N, 106 12 06E'),
(605, 54, 'Châu Thành', 'Huyện', '9 52 57N, 106 24 12E'),
(606, 54, 'Cầu Ngang', 'Huyện', '9 47 14N, 106 29 19E'),
(607, 54, 'Trà Cú', 'Huyện', '9 42 06N, 106 16 24E'),
(608, 54, 'Duyên Hải', 'Huyện', '9 39 58N, 106 26 23E'),
(609, 55, 'Vĩnh Long', 'Thành Phố', '10 15 09N, 105 56 08E'),
(610, 55, 'Long Hồ', 'Huyện', '10 13 58N, 105 55 47E'),
(611, 55, 'Mang Thít', 'Huyện', '10 10 58N, 106 05 13E'),
(612, 55, 'Vũng Liêm', 'Huyện', '10 03 32N, 106 10 35E'),
(613, 55, 'Tam Bình', 'Huyện', '10 03 58N, 105 58 03E'),
(614, 55, 'Bình Minh', 'Huyện', '10 05 45N, 105 47 21E'),
(615, 55, 'Trà Ôn', 'Huyện', '9 59 20N, 105 57 56E'),
(616, 55, 'Bình Tân', 'Huyện', ''),
(617, 56, 'Cao Lãnh', 'Thành Phố', '10 27 38N, 105 37 21E'),
(618, 56, 'Sa Đéc', 'Thị Xã', '10 19 22N, 105 44 31E'),
(619, 56, 'Hồng Ngự', 'Thị Xã', ''),
(620, 56, 'Tân Hồng', 'Huyện', '10 52 48N, 105 29 21E'),
(621, 56, 'Hồng Ngự', 'Huyện', '10 48 13N, 105 19 00E'),
(622, 56, 'Tam Nông', 'Huyện', '10 44 06N, 105 30 58E'),
(623, 56, 'Tháp Mười', 'Huyện', '10 33 36N, 105 47 13E'),
(624, 56, 'Cao Lãnh', 'Huyện', '10 29 03N, 105 41 40E'),
(625, 56, 'Thanh Bình', 'Huyện', '10 36 38N, 105 28 51E'),
(626, 56, 'Lấp Vò', 'Huyện', '10 21 27N, 105 36 06E'),
(627, 56, 'Lai Vung', 'Huyện', '10 14 43N, 105 38 40E'),
(628, 56, 'Châu Thành', 'Huyện', '10 13 27N, 105 48 38E'),
(629, 57, 'Long Xuyên', 'Thành Phố', '10 22 22N, 105 25 33E'),
(630, 57, 'Châu Đốc', 'Thị Xã', '10 41 20N, 105 05 15E'),
(631, 57, 'An Phú', 'Huyện', '10 50 12N, 105 05 33E'),
(632, 57, 'Tân Châu', 'Thị Xã', '10 49 11N, 105 11 18E'),
(633, 57, 'Phú Tân', 'Huyện', '10 40 26N, 105 14 40E'),
(634, 57, 'Châu Phú', 'Huyện', '10 34 12N, 105 12 13E'),
(635, 57, 'Tịnh Biên', 'Huyện', '10 33 30N, 105 00 17E'),
(636, 57, 'Tri Tôn', 'Huyện', '10 24 41N, 104 56 58E'),
(637, 57, 'Châu Thành', 'Huyện', '10 25 39N, 105 15 31E'),
(638, 57, 'Chợ Mới', 'Huyện', '10 27 23N, 105 26 57E'),
(639, 57, 'Thoại Sơn', 'Huyện', '10 16 45N, 105 15 59E'),
(640, 58, 'Rạch Giá', 'Thành Phố', '10 01 35N, 105 06 20E'),
(641, 58, 'Hà Tiên', 'Thị Xã', '10 22 54N, 104 30 10E'),
(642, 58, 'Kiên Lương', 'Huyện', '10 20 21N, 104 39 46E'),
(643, 58, 'Hòn Đất', 'Huyện', '10 14 20N, 104 55 57E'),
(644, 58, 'Tân Hiệp', 'Huyện', '10 05 18N, 105 14 04E'),
(645, 58, 'Châu Thành', 'Huyện', '9 57 37N, 105 10 16E'),
(646, 58, 'Giồng Giềng', 'Huyện', '9 56 05N, 105 22 06E'),
(647, 58, 'Gò Quao', 'Huyện', '9 43 17N, 105 17 06E'),
(648, 58, 'An Biên', 'Huyện', '9 48 37N, 105 03 18E'),
(649, 58, 'An Minh', 'Huyện', '9 40 24N, 104 59 05E'),
(650, 58, 'Vĩnh Thuận', 'Huyện', '9 33 25N, 105 11 30E'),
(651, 58, 'Phú Quốc', 'Huyện', '10 13 44N, 103 57 25E'),
(652, 58, 'Kiên Hải', 'Huyện', '9 48 31N, 104 37 48E'),
(653, 58, 'U Minh Thượng', 'Huyện', ''),
(654, 58, 'Giang Thành', 'Huyện', ''),
(655, 59, 'Ninh Kiều', 'Quận', '10 01 58N, 105 45 34E'),
(656, 59, 'Ô Môn', 'Quận', '10 07 28N, 105 37 51E'),
(657, 59, 'Bình Thuỷ', 'Quận', '10 03 42N, 105 43 17E'),
(658, 59, 'Cái Răng', 'Quận', '9 59 57N, 105 46 56E'),
(659, 59, 'Thốt Nốt', 'Quận', '10 14 23N, 105 32 02E'),
(660, 59, 'Vĩnh Thạnh', 'Huyện', '10 11 35N, 105 22 45E'),
(661, 59, 'Cờ Đỏ', 'Huyện', '10 02 48N, 105 29 46E'),
(662, 59, 'Phong Điền', 'Huyện', '9 59 57N, 105 39 35E'),
(663, 59, 'Thới Lai', 'Huyện', ''),
(664, 60, 'Vị Thanh', 'Thị Xã', '9 45 15N, 105 24 50E'),
(665, 60, 'Ngã Bảy', 'Thị Xã', ''),
(666, 60, 'Châu Thành A', 'Huyện', '9 55 50N, 105 38 31E'),
(667, 60, 'Châu Thành', 'Huyện', '9 55 22N, 105 48 37E'),
(668, 60, 'Phụng Hiệp', 'Huyện', '9 47 20N, 105 43 29E'),
(669, 60, 'Vị Thuỷ', 'Huyện', '9 48 05N, 105 32 13E'),
(670, 60, 'Long Mỹ', 'Huyện', '9 40 47N, 105 30 53E'),
(671, 61, 'Sóc Trăng', 'Thành Phố', '9 36 39N, 105 59 00E'),
(672, 61, 'Châu Thành', 'Huyện', ''),
(673, 61, 'Kế Sách', 'Huyện', '9 49 30N, 105 57 25E'),
(674, 61, 'Mỹ Tú', 'Huyện', '9 38 21N, 105 49 52E'),
(675, 61, 'Cù Lao Dung', 'Huyện', '9 37 36N, 106 12 13E'),
(676, 61, 'Long Phú', 'Huyện', '9 34 38N, 106 06 07E'),
(677, 61, 'Mỹ Xuyên', 'Huyện', '9 28 16N, 105 55 51E'),
(678, 61, 'Ngã Năm', 'Huyện', '9 31 38N, 105 37 22E'),
(679, 61, 'Thạnh Trị', 'Huyện', '9 28 05N, 105 43 02E'),
(680, 61, 'Vĩnh Châu', 'Huyện', '9 20 50N, 105 59 58E'),
(681, 61, 'Trần Đề', 'Huyện', ''),
(682, 62, 'Bạc Liêu', 'Thị Xã', '9 16 05N, 105 45 08E'),
(683, 62, 'Hồng Dân', 'Huyện', '9 30 37N, 105 24 25E'),
(684, 62, 'Phước Long', 'Huyện', '9 23 13N, 105 24 41E'),
(685, 62, 'Vĩnh Lợi', 'Huyện', '9 16 51N, 105 40 54E'),
(686, 62, 'Giá Rai', 'Huyện', '9 15 51N, 105 23 18E'),
(687, 62, 'Đông Hải', 'Huyện', '9 08 11N, 105 24 42E'),
(688, 62, 'Hoà Bình', 'Huyện', ''),
(689, 63, 'Cà Mau', 'Thành Phố', '9 10 33N, 105 11 11E'),
(690, 63, 'U Minh', 'Huyện', '9 22 30N, 104 57 00E'),
(691, 63, 'Thới Bình', 'Huyện', '9 22 50N, 105 07 35E'),
(692, 63, 'Trần Văn Thời', 'Huyện', '9 07 36N, 104 57 27E'),
(693, 63, 'Cái Nước', 'Huyện', '9 00 31N, 105 03 23E'),
(694, 63, 'Đầm Dơi', 'Huyện', '8 57 48N, 105 13 56E'),
(695, 63, 'Năm Căn', 'Huyện', '8 46 59N, 104 58 20E'),
(696, 63, 'Phú Tân', 'Huyện', '8 52 47N, 104 53 35E'),
(697, 63, 'Ngọc Hiển', 'Huyện', '8 40 47N, 104 57 58E');

-- --------------------------------------------------------

--
-- Table structure for table `migrations`
--

CREATE TABLE `migrations` (
  `id` int(10) UNSIGNED NOT NULL,
  `migration` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `batch` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `orders`
--

CREATE TABLE `orders` (
  `order_id` bigint(20) NOT NULL,
  `user_id` int(10) DEFAULT NULL,
  `subtotal` int(10) DEFAULT NULL,
  `tax` int(10) DEFAULT NULL,
  `delivery` int(10) DEFAULT NULL,
  `total` int(10) DEFAULT NULL,
  `note` varchar(255) DEFAULT NULL,
  `status` tinyint(1) DEFAULT '0',
  `cancel_reason` varchar(1023) DEFAULT NULL,
  `deleted_at` datetime DEFAULT NULL,
  `created_at` datetime DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL ON UPDATE CURRENT_TIMESTAMP,
  `created_by` int(10) DEFAULT NULL,
  `updated_by` int(10) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `orders`
--

INSERT INTO `orders` (`order_id`, `user_id`, `subtotal`, `tax`, `delivery`, `total`, `note`, `status`, `cancel_reason`, `deleted_at`, `created_at`, `updated_at`, `created_by`, `updated_by`) VALUES
(1, 1, 675000, 0, 0, 675000, 'note more sdfsdfasd df asdfasdf dsfasdfd sdfsdf', 3, NULL, NULL, '2018-07-26 09:59:12', '2018-08-02 04:38:51', 1, 2),
(2, 1, 65000, 0, 0, 65000, 'dsjkfhasdf asdfasdf a;sdflasdjfas;df', 0, NULL, NULL, '2018-07-31 16:18:00', '2018-08-01 03:18:03', 1, NULL),
(3, 2, 540000, 0, 0, 540000, 'Deliveried', 1, NULL, NULL, '2018-07-31 17:40:45', '2018-08-01 03:18:51', 2, 1),
(4, 1, 18500, 0, 0, 18500, NULL, 0, NULL, NULL, '2018-08-02 16:08:26', '2018-08-02 09:08:26', 1, NULL);

-- --------------------------------------------------------

--
-- Table structure for table `order_details`
--

CREATE TABLE `order_details` (
  `order_detail_id` bigint(20) NOT NULL,
  `order_id` bigint(20) DEFAULT NULL,
  `product_id` int(10) DEFAULT NULL,
  `price` int(10) DEFAULT NULL,
  `quantity` int(10) DEFAULT NULL,
  `total` int(10) DEFAULT NULL,
  `status` tinyint(1) DEFAULT '0',
  `deleted_at` datetime DEFAULT NULL,
  `created_at` datetime DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL ON UPDATE CURRENT_TIMESTAMP,
  `created_by` int(10) DEFAULT NULL,
  `updated_by` int(10) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `order_details`
--

INSERT INTO `order_details` (`order_detail_id`, `order_id`, `product_id`, `price`, `quantity`, `total`, `status`, `deleted_at`, `created_at`, `updated_at`, `created_by`, `updated_by`) VALUES
(1, 1, 6, 135000, 5, 675000, 0, NULL, '2018-07-26 09:59:12', '2018-07-26 02:59:12', 1, NULL),
(2, 2, 13, 65000, 1, 65000, 0, NULL, '2018-07-31 16:18:00', '2018-07-31 09:18:00', 1, NULL),
(3, 3, 9, 180000, 3, 540000, 0, NULL, '2018-07-31 17:40:45', '2018-07-31 10:40:45', 2, NULL),
(4, 4, 20, 18500, 1, 18500, 0, NULL, '2018-08-02 16:08:26', '2018-08-02 09:08:26', 1, NULL);

-- --------------------------------------------------------

--
-- Table structure for table `password_resets`
--

CREATE TABLE `password_resets` (
  `email` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `token` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` datetime DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `password_resets`
--

INSERT INTO `password_resets` (`email`, `token`, `created_at`) VALUES
('ryantran.vn@gmail.com', '$2y$10$z6v2kncoJX.MVF.Ghd4nne/e3H3BG23pEjDxTSnsALQ5vzfbsNgVS', '2018-06-28 14:41:26'),
('ryantran.laravel@gmail.com', '$2y$10$1Mc5LA97z5FzicvVOuV14ed3OBV/XyHS5ScF607bY.RD6pvsRBYSi', '2018-06-28 20:41:13');

-- --------------------------------------------------------

--
-- Table structure for table `pictures`
--

CREATE TABLE `pictures` (
  `picture_id` bigint(20) NOT NULL,
  `module` varchar(255) DEFAULT NULL,
  `product_id` int(10) DEFAULT NULL,
  `url` varchar(255) DEFAULT NULL,
  `order` tinyint(2) DEFAULT '0',
  `deleted_at` datetime DEFAULT NULL,
  `created_at` datetime DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `pictures`
--

INSERT INTO `pictures` (`picture_id`, `module`, `product_id`, `url`, `order`, `deleted_at`, `created_at`, `updated_at`) VALUES
(1, 'product', 1, '/upload/images/products/713429.jpg', 0, NULL, '2018-07-25 16:54:42', '2018-07-25 09:54:42'),
(2, 'product', 2, '/upload/images/products/187314.jpg', 0, NULL, '2018-07-25 16:57:50', '2018-07-25 09:57:50'),
(3, 'product', 2, '/upload/images/products/187314_1.jpg', 0, NULL, '2018-07-25 16:57:50', '2018-07-25 09:57:50'),
(4, 'product', 2, '/upload/images/products/187314_2.jpg', 0, NULL, '2018-07-25 16:57:50', '2018-07-25 09:57:50'),
(5, 'product', 3, '/upload/images/products/154991.jpg', 0, NULL, '2018-07-25 17:04:40', '2018-07-25 10:04:40'),
(6, 'product', 4, '/upload/images/products/download.jpeg', 0, '2018-07-27 17:17:20', '2018-07-25 17:09:48', '2018-07-27 10:17:20'),
(7, 'product', 5, '/upload/images/products/cauliflower-cheese-sauce.jpg', 0, NULL, '2018-07-25 17:13:00', '2018-07-25 10:13:00'),
(8, 'product', 5, '/upload/images/products/download%20(1).jpeg', 0, NULL, '2018-07-25 17:13:00', '2018-07-25 10:13:00'),
(9, 'product', 5, '/upload/images/products/images.jpeg', 0, NULL, '2018-07-25 17:13:00', '2018-07-25 10:13:00'),
(10, 'product', 5, '/upload/images/products/817uoYw7ElL._SY355_.jpg', 0, NULL, '2018-07-25 17:13:00', '2018-07-25 10:13:00'),
(11, 'product', 6, '/upload/images/products/images%20(1).jpeg', 0, NULL, '2018-07-25 17:15:42', '2018-07-25 10:15:42'),
(12, 'product', 6, '/upload/images/products/download%20(2).jpeg', 0, NULL, '2018-07-25 17:15:42', '2018-07-25 10:15:42'),
(13, 'product', 7, '/upload/images/products/Beans%20Round1.jpeg', 0, NULL, '2018-07-25 17:19:19', '2018-07-25 10:19:19'),
(14, 'product', 7, '/upload/images/products/Beans%20Round2.jpg', 0, NULL, '2018-07-25 17:19:20', '2018-07-25 10:19:20'),
(15, 'product', 7, '/upload/images/products/Beans%20Round3.jpeg', 0, NULL, '2018-07-25 17:19:20', '2018-07-25 10:19:20'),
(16, 'product', 7, '/upload/images/products/Beans%20Round4.jpeg', 0, NULL, '2018-07-25 17:19:20', '2018-07-25 10:19:20'),
(17, 'product', 8, '/upload/images/products/meat1.jpeg', 0, NULL, '2018-07-25 20:14:52', '2018-07-25 13:14:52'),
(18, 'product', 8, '/upload/images/products/meat2.jpeg', 0, NULL, '2018-07-25 20:14:52', '2018-07-25 13:14:52'),
(19, 'product', 9, '/upload/images/products/mest_chops2.jpg', 0, NULL, '2018-07-25 20:18:39', '2018-07-25 13:18:39'),
(20, 'product', 9, '/upload/images/products/mest_chops3.jpg', 0, NULL, '2018-07-25 20:18:39', '2018-07-25 13:18:39'),
(21, 'product', 10, '/upload/images/products/beef1.jpg', 0, NULL, '2018-07-25 20:21:10', '2018-07-25 13:21:10'),
(22, 'product', 10, '/upload/images/products/beef2.jpg', 0, NULL, '2018-07-25 20:21:10', '2018-07-25 13:21:10'),
(23, 'product', 10, '/upload/images/products/beef3.jpg', 0, NULL, '2018-07-25 20:21:10', '2018-07-25 13:21:10'),
(24, 'product', 10, '/upload/images/products/beef4.jpg', 0, NULL, '2018-07-25 20:21:10', '2018-07-25 13:21:10'),
(25, 'product', 11, '/upload/images/products/213430011_0_640x640.jpg', 0, NULL, '2018-07-25 20:25:49', '2018-07-25 13:25:49'),
(26, 'product', 11, '/upload/images/products/download%20(3).jpeg', 0, NULL, '2018-07-25 20:25:49', '2018-07-25 13:25:49'),
(27, 'product', 11, '/upload/images/products/images%20(2).jpeg', 0, NULL, '2018-07-25 20:25:50', '2018-07-25 13:25:50'),
(28, 'product', 12, '/upload/images/products/426911.jpg', 0, NULL, '2018-07-25 20:28:27', '2018-07-25 13:28:27'),
(29, 'product', 12, '/upload/images/products/717237.jpg', 0, NULL, '2018-07-25 20:28:28', '2018-07-25 13:28:28'),
(30, 'product', 13, '/upload/images/products/199902.jpg', 0, NULL, '2018-07-25 20:30:09', '2018-07-25 13:30:09'),
(31, 'product', 13, '/upload/images/products/179994.jpg', 0, NULL, '2018-07-25 20:30:09', '2018-07-25 13:30:09'),
(32, 'product', 14, '/upload/images/products/372556.jpg', 0, NULL, '2018-07-25 20:31:52', '2018-07-25 13:31:52'),
(33, 'product', 14, '/upload/images/products/download%20(4).jpeg', 0, NULL, '2018-07-25 20:31:53', '2018-07-25 13:31:53'),
(34, 'product', 15, '/upload/images/products/download%20(6).jpeg', 0, NULL, '2018-07-25 20:33:55', '2018-07-25 13:33:55'),
(35, 'product', 15, '/upload/images/products/download%20(5).jpeg', 0, NULL, '2018-07-25 20:33:55', '2018-07-25 13:33:55'),
(36, 'product', 15, '/upload/images/products/65243011_2_640x640.jpg', 0, NULL, '2018-07-25 20:33:55', '2018-07-25 13:33:55'),
(37, 'product', 16, '/upload/images/products/spanish_onions_02295803-c0f3-477f-a69d-a5742b4a0e63_grande.jpeg', 0, NULL, '2018-07-25 20:36:09', '2018-07-25 13:36:09'),
(38, 'product', 16, '/upload/images/products/images%20(3).jpeg', 0, NULL, '2018-07-25 20:36:09', '2018-07-25 13:36:09'),
(39, 'product', 17, '/upload/images/products/images%20(4).jpeg', 0, NULL, '2018-07-26 11:37:00', '2018-07-26 04:37:00'),
(40, 'product', 17, '/upload/images/products/Super-Green_Elderflower_grande.jpg', 0, NULL, '2018-07-26 11:37:00', '2018-07-26 04:37:00'),
(41, 'product', 18, '/upload/images/products/326606.jpg', 0, NULL, '2018-07-26 11:39:43', '2018-07-26 04:39:43'),
(42, 'product', 18, '/upload/images/products/download%20(7).jpeg', 0, NULL, '2018-07-26 11:39:43', '2018-07-26 04:39:43'),
(43, 'product', 19, '/upload/images/products/images%20(5).jpeg', 0, NULL, '2018-07-26 11:42:20', '2018-07-26 04:42:20'),
(44, 'product', 19, '/upload/images/products/download%20(8).jpeg', 0, NULL, '2018-07-26 11:42:21', '2018-07-26 04:42:21'),
(45, 'product', 20, '/upload/images/products/2230_17287_z.jpg', 0, NULL, '2018-07-26 11:44:33', '2018-07-26 04:44:33'),
(46, 'product', 21, '/upload/images/products/76_18259_z.jpg', 0, NULL, '2018-07-26 11:46:54', '2018-07-26 04:46:54'),
(47, 'product', 21, '/upload/images/products/76_18150_z.jpg', 0, NULL, '2018-07-26 11:46:55', '2018-07-26 04:46:55'),
(48, 'product', 21, '/upload/images/products/76_18151_z.jpg', 0, NULL, '2018-07-26 11:46:55', '2018-07-26 04:46:55'),
(49, 'product', 21, '/upload/images/products/76_18152_z.jpg', 0, NULL, '2018-07-26 11:46:55', '2018-07-26 04:46:55'),
(50, 'product', 22, '/upload/images/products/1753_10612_z.jpg', 0, NULL, '2018-07-26 13:52:52', '2018-07-26 06:52:52'),
(51, 'product', 22, '/upload/images/products/1753_20854_z.jpg', 0, NULL, '2018-07-26 13:52:52', '2018-07-26 06:52:52'),
(52, 'product', 23, '/upload/images/products/1753_20854_z.jpg', 0, NULL, '2018-07-26 13:53:31', '2018-07-26 06:53:31'),
(53, 'product', 24, '/upload/images/products/4030_21537_z.jpg', 0, NULL, '2018-07-26 13:57:08', '2018-07-26 06:57:08'),
(54, 'product', 25, '/upload/images/products/3045_21419_z.jpg', 0, NULL, '2018-07-26 13:58:12', '2018-07-26 06:58:12'),
(55, 'product', 26, '/upload/images/products/3054_21959_z.jpg', 0, NULL, '2018-07-26 13:59:21', '2018-07-26 06:59:21'),
(56, 'product', 27, '/upload/images/products/7948_21401_z.jpg', 0, '2018-07-27 10:48:37', '2018-07-26 14:00:28', '2018-07-27 03:48:37'),
(57, 'product', 27, '/upload/images/products/7948_21401_z.jpg', 0, NULL, '2018-07-27 10:48:37', '2018-07-27 03:48:37'),
(58, 'product', 4, '/upload/images/products/download.jpeg', 0, NULL, '2018-07-27 17:17:20', '2018-07-27 10:17:20');

-- --------------------------------------------------------

--
-- Table structure for table `products`
--

CREATE TABLE `products` (
  `product_id` bigint(20) NOT NULL,
  `name` varchar(255) DEFAULT NULL,
  `slug` varchar(511) DEFAULT NULL,
  `category_id` int(10) DEFAULT NULL,
  `supplier_id` int(10) DEFAULT NULL,
  `small_description` varchar(1023) DEFAULT NULL,
  `description` text,
  `price` int(10) DEFAULT NULL,
  `order` int(10) DEFAULT '0',
  `status` tinyint(1) DEFAULT '1',
  `recommend` tinyint(1) DEFAULT '0',
  `deleted_at` datetime DEFAULT NULL,
  `created_by` int(10) DEFAULT NULL,
  `updated_by` int(10) DEFAULT NULL,
  `created_at` datetime DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `products`
--

INSERT INTO `products` (`product_id`, `name`, `slug`, `category_id`, `supplier_id`, `small_description`, `description`, `price`, `order`, `status`, `recommend`, `deleted_at`, `created_by`, `updated_by`, `created_at`, `updated_at`) VALUES
(1, 'Garlic Australian each', 'garlic-australian-each', 1, 1, NULL, '<p class=\"p1\">Bulb made up of segments called cloves, covered by a papery shell. The most common varieties of garlic contain 10 cloves (or segments) with white skin. Other varieties have pink or purple skin and larger cloves. As a rule, the smaller the clove, the stronger the taste.&nbsp;</p>\r\n<p class=\"p1\">It is a member of the allium family that also includes onions, chives, shallots, spring onions and leeks.</p>\r\n<p class=\"p2\">&nbsp;</p>\r\n<p class=\"p1\"><strong><em>What to look for</em></strong></p>\r\n<p class=\"p1\">Look for firm well-shaped cloves. Buy in small amounts and break off the cloves only when needed. Garlic dries out once detached. bulb of garlic has had its roots trimmed, one at a time. Garlic is never labelled since it sheds its skin if a label is applied to it.</p>\r\n<p class=\"p2\">&nbsp;</p>\r\n<p class=\"p1\"><strong><em>Availability</em></strong></p>\r\n<p class=\"p1\">All year.</p>\r\n<p class=\"p2\">&nbsp;</p>\r\n<p class=\"p1\"><strong><em>Store</em></strong></p>\r\n<p class=\"p1\">Keep in a cool dry place away from the sunlight. Avoid placing in plastic bags, or storing in the refrigerator or everything in the refrigerator will end up tasting of garlic. Avoid storing next to ginger as ginger dehydrates garlic.</p>\r\n<p class=\"p2\">&nbsp;</p>\r\n<p class=\"p1\"><strong><em>How to prepare</em></strong></p>\r\n<p class=\"p1\">Separate cloves from bulbs, remove papery skin unless roasting when skin can be left on. Cut bulbs in half crosswise and brush with oil to roast. To remove skin, press the clove under the flat side of a knife and the skin will come off easily. Chop the garlic very finely or crush it with the side of a knife. Alternatively, use a garlic crusher.</p>\r\n<p class=\"p2\">&nbsp;</p>\r\n<p class=\"p1\"><strong><em>Ways to eat</em></strong></p>\r\n<p class=\"p1\">Garlic can be eaten raw or cooked. Raw garlic produces a strong, pungent flavour while cooking gives a more mellow flavour. The longer garlic is cooked, the milder and sweeter the flavour. It\'s usually used in small amounts, 2-3 cloves to a dish. Garlic burns easily, so take care when frying or saut&eacute;ing. It can be used in vegetable dishes, meats, soups, dips, stir fries, braises and stews. Add whole unpeeled cloves into a roasting pan with meat or vegetables. Cut a whole head in half horizontally and roast in a little olive oil. When cooked, serve as it is, or squeeze the roasted flesh out and serve on crostini or fresh bread.</p>\r\n<p class=\"p2\">&nbsp;</p>\r\n<p class=\"p1\"><strong><em>Cooking Methods</em></strong></p>\r\n<p class=\"p1\">Roast, braise, stew, stir fry.</p>', 100000, 0, 1, 0, NULL, 1, NULL, '2018-07-25 16:54:42', '2018-07-27 04:42:25'),
(2, 'Broccolini Bunch each', 'broccolini-bunch-each', 1, 4, NULL, '<p class=\"p1\">This is a natural cross between broccoli and Chinese broccoli (gaai lan). It has a long slender stem topped with small flowering buds that are a cross between broccoli florets and an asparagus tip.</p>\r\n<p class=\"p2\">&nbsp;</p>\r\n<p class=\"p1\"><strong><em>What to look for</em></strong></p>\r\n<p class=\"p1\">Choose compact bud clusters with no yellow colouring or large open buds. Heads should be dark green or have a purple tinge (except for Romanesco, orange broccoli and broccoflower &ndash; they are a lighter, brighter green).</p>\r\n<p class=\"p2\">&nbsp;</p>\r\n<p class=\"p1\"><strong><em>Availability</em></strong></p>\r\n<p class=\"p1\">All Year.</p>\r\n<p class=\"p2\">&nbsp;</p>\r\n<p class=\"p1\"><strong><em>Store</em></strong></p>\r\n<p class=\"p1\">Refrigerate in plastic bags. Use promptly.</p>\r\n<p class=\"p2\">&nbsp;</p>\r\n<p class=\"p1\"><strong><em>How to prepare</em></strong></p>\r\n<p class=\"p1\">Trim stalks and divide heads into even sized portions. The stalks can be left attached to the florets. Alternatively, stalks can be removed, sliced finely and used in stir fries and soups; or julienned and used in coleslaw. Broccoli is usually eaten cooked &ndash; however, cook only until tender and still slightly crisp. Cook using methods such as steaming, microwaving and stir frying. To blanch, simply place portions in boiling water for 1-2 minutes, drain and cool under cold running water. Blanching improves taste, colour and texture.</p>\r\n<p class=\"p2\">&nbsp;</p>\r\n<p class=\"p1\"><strong><em>Ways to eat</em></strong></p>\r\n<p class=\"p1\">Broccoli is one of the most versatile vegetables. It can be served raw or lightly blanched and used in salads, pasta dishes, omelettes, quiches, soups and as a side dish.</p>\r\n<p class=\"p2\">&nbsp;</p>\r\n<p class=\"p1\"><strong><em>Cooking Methods</em></strong></p>\r\n<p class=\"p1\">Boil, steam, microwave, roast, stir fry.</p>', 250000, 0, 1, 0, NULL, 1, NULL, '2018-07-25 16:57:50', '2018-07-27 04:42:25'),
(3, 'Pak Choy Baby Asian Greens each', 'pak-choy-baby-asian-greens-each', 1, 2, NULL, '<p class=\"p1\">Woolworths Select Baby Pak Choy.</p>', 90000, 0, 1, 0, NULL, 1, NULL, '2018-07-25 17:04:40', '2018-07-27 04:42:25'),
(4, 'Eggplant Fresh each', 'eggplant-fresh-each', 1, 5, NULL, '<p class=\"p1\">A smooth, shiny deep purple-blackish skinned vegetable with a creamy white interior with many small light brown seeds dispersed through the flesh. Uncooked.</p>', 45000, 0, 1, 0, NULL, 1, NULL, '2018-07-25 17:09:48', '2018-07-27 10:17:20'),
(5, 'Cauliflower Fresh whole each', 'cauliflower-fresh-whole-each', 1, 2, NULL, '<p class=\"p1\">Tight white flower clusters which form the head, with a white stem. Uncooked.</p>', 75000, 0, 1, 0, NULL, 1, NULL, '2018-07-25 17:13:00', '2018-07-27 04:42:25'),
(6, 'Pumpkin Butternut Cut min. 500g', 'pumpkin-butternut-cut-min-500g', 1, 1, NULL, '<p class=\"p1\">Woolworths Butternut Pumpkin.</p>', 135000, 0, 1, 0, NULL, 1, NULL, '2018-07-25 17:15:41', '2018-07-27 04:42:25'),
(7, 'Beans Round per kg', 'beans-round-per-kg', 1, 2, NULL, '<p class=\"p1\">Long, thin, green, crisp pod with small round smooth seeds inside.</p>', 55000, 0, 1, 0, NULL, 1, NULL, '2018-07-25 17:19:19', '2018-07-27 04:42:25'),
(8, 'Porks Ribs Aussie Roast 350g - 700g', 'porks-ribs-aussie-roast-350g-700g', 6, 1, NULL, '<p class=\"p1\">This is a variable weight product and is priced by $/kg. Once we&rsquo;ve picked your item in store, we&rsquo;ll refund you for the difference between the weight paid and the weight received.</p>', 300000, 0, 1, 0, NULL, 1, NULL, '2018-07-25 20:14:52', '2018-07-27 04:42:25'),
(9, 'Pork Midloin Chops 300g - 600g', 'pork-midloin-chops-300g-600g', 6, 1, NULL, '<p class=\"p1\">This is a variable weight product and is priced by $/kg. Once we&rsquo;ve picked your item in store, we&rsquo;ll refund you for the difference between the weight paid and the weight received.</p>', 180000, 0, 1, 0, NULL, 1, NULL, '2018-07-25 20:18:38', '2018-07-27 04:42:25'),
(10, 'Msa Beef Rump Steak 1-2 Pieces 300g - 700g', 'msa-beef-rump-steak-1-2-pieces-300g-700g', 6, 2, NULL, '<p class=\"p1\">This is a variable weight product and is priced by $/kg. Once we&rsquo;ve picked your item in store, we&rsquo;ll refund you for the difference between the weight paid and the weight received.</p>', 315000, 0, 1, 0, NULL, 1, NULL, '2018-07-25 20:21:10', '2018-07-27 04:42:25'),
(11, 'Beef Topside Roast Heart Smart 1kg - 1.4kg', 'beef-topside-roast-heart-smart-1kg-14kg', 6, 5, NULL, '<p class=\"p1\">This is a variable weight product and is priced by $/kg. Once we&rsquo;ve picked your item in store, we&rsquo;ll refund you for the difference between the weight paid and the weight received.</p>', 475000, 0, 1, 0, NULL, 1, NULL, '2018-07-25 20:25:49', '2018-07-27 04:42:25'),
(12, 'Macro Certified Organic Baby Spinach 100g', 'macro-certified-organic-baby-spinach-100g', 2, 4, NULL, '<p class=\"p1\">Our organic baby spinach are freshly pick at the right maturity from our farm. Our organic baby spinach can be perfectly used in a smoothy ; cooked in a dish or as a garnish to decorate your plate and why not just add a vinaigrette dressing for a fresh salad.</p>', 75000, 0, 1, 0, NULL, 1, NULL, '2018-07-25 20:28:27', '2018-07-27 04:42:25'),
(13, 'Mushrooms Cups Organic 150g punnet', 'mushrooms-cups-organic-150g-punnet', 2, 3, NULL, '<p class=\"p1\">Macro Organic Mushroom cups are organic.</p>', 65000, 0, 1, 0, NULL, 1, NULL, '2018-07-25 20:30:09', '2018-07-27 04:42:25'),
(14, 'Corn Sweet Organic 400g', 'corn-sweet-organic-400g', 2, 3, NULL, '<p class=\"p1\">Uniquely sweet, organic sweet corn tastes great whether you cook, boil, microwave or bbq. Organic sweet corn is a source of folate and thiamin which helps support a healthy brain and nervous system. So whether served as a main or a side to a meal, add an explosion of sweetness to every mouthful with organic sweet corn.</p>', 110000, 0, 1, 0, NULL, 1, NULL, '2018-07-25 20:31:52', '2018-07-27 04:42:25'),
(15, 'Carrot Organic 750g', 'carrot-organic-750g', 2, 2, NULL, '<p class=\"p1\">Macro Organic Carrots</p>', 85000, 0, 1, 0, NULL, 1, NULL, '2018-07-25 20:33:54', '2018-07-27 04:42:25'),
(16, 'Spanish Onion Red Organic 500g', 'spanish-onion-red-organic-500g', 2, 5, NULL, '<p class=\"p1\">To avoid weeping buckets when it comes to chopping time, follow these tips:&nbsp;</p>\r\n<p class=\"p1\">- Chill your onions in the fridge before slicing - the colder they are, the better&nbsp;</p>\r\n<p class=\"p1\">- Use a sharp knife - blunt knives burst more of those tear-inducing onion cells&nbsp;</p>\r\n<p class=\"p1\">- Slice under a trickle of water - it helps wash away the pongy vapours&nbsp;</p>\r\n<p class=\"p1\">- Wear swimming goggles&nbsp;</p>\r\n<p class=\"p2\">&nbsp;</p>\r\n<p class=\"p1\">Store your onions in the fridge, avoiding dampness, or in a cool dark larder.</p>', 135000, 0, 1, 0, NULL, 1, NULL, '2018-07-25 20:36:09', '2018-07-27 04:42:25'),
(17, 'Green Tea, Organic, Clipper (50 bags)', 'green-tea-organic-clipper-50-bags', 3, 4, NULL, '<p class=\"p1\">Green tea* (in unbleached bags) * = produced to organic standards.</p>', 30000, 0, 1, 0, NULL, 1, NULL, '2018-07-26 11:37:00', '2018-07-27 04:42:25'),
(18, 'Lemon & Ginger Tea, Organic, Clipper (20 bags)', 'lemon-ginger-tea-organic-clipper-20-bags', 3, 2, NULL, '<p class=\"p1\">This warming spicy organic Lemon &amp; Ginger Tea is like a fine wine. It&rsquo;s best to give it a good sniff before you drink it.&nbsp;Ginger is traditionally used to help digestion. It also tastes incredible, which is a handy coincidence.</p>', 19500, 0, 1, 0, NULL, 1, NULL, '2018-07-26 11:39:43', '2018-07-27 04:42:25'),
(19, 'Everyday Tea, Organic, Clipper (80 bags)', 'everyday-tea-organic-clipper-80-bags', 3, 3, NULL, '<p></p>\r\n<p class=\"p1\">Clipper\'s Fairtrade Everyday Tea set the benchmark for their range.&nbsp;This is a blend of the finest black tea leaves from Fairtrade-certified tea estates in Africa, India and Sri Lanka.&nbsp;It\'s the perfect cuppa for morning, noon and after dinner.</p>\r\n<p>&nbsp;</p>', 21500, 0, 1, 0, NULL, 1, NULL, '2018-07-26 11:42:20', '2018-07-27 04:42:25'),
(20, 'Guernsey Milk, Organic, Whole (1 litre)', 'guernsey-milk-organic-whole-1-litre', 4, 1, NULL, '<p class=\"p1\">This is special 100% pure Guernsey milk. Guernsey cows have the highest count of A2 milk of all dairy cows and their milk has a brilliant golden colour. Unhomogenised, pasteurised and extremely fresh, this is milk the proper way.&nbsp;</p>', 18500, 0, 1, 0, NULL, 1, NULL, '2018-07-26 11:44:33', '2018-07-27 04:42:25'),
(21, 'Eggs, Organic Free Range (6 medium)', 'eggs-organic-free-range-6-medium', 4, 1, NULL, '<p class=\"p1\">Our organic eggs are from free range hens that roam around in the sun, peck at an organic diet and get the benefits of free range (just like us). This makes their eggs perfect fried, poached or deviled. These are Class A Medium, cracking in a fry up.<br /> <br /> Andrew&rsquo;s eggs are part of the Laid in Britain Quality Assurance team for smaller producers. They assure standards particularly relating to food safety and no eggs laid under the Laid in Britain scheme have ever in its 17 year history been found to have salmonella. So even although they might not have that little lion on them there&rsquo;s no need to fret, these eggs are of the highest quality.</p>', 45000, 0, 1, 0, NULL, 1, NULL, '2018-07-26 11:46:54', '2018-07-27 04:42:25'),
(22, 'Godminster Vintage Cheddar, Organic (200g)', 'godminster-vintage-cheddar-organic-200g', 4, 5, NULL, '<p class=\"p1\">A rich, strong yet buttery cheese that is delicious on its own, eaten with oatcakes and chutney, or devoured in hunks with an organic apple from your box. It also makes a sinfully good Welsh rarebit on toast. Good Godminster fortune shined down when we came upon one of the best organic mature cheddars we\'ve ever had the pleasure to taste. This one makes the roof of your mouth tingle once you&rsquo;ve liberated it from its handsome, burgundy wax casing. Godminster, that&rsquo;s good!</p>', 85000, 0, 1, 0, NULL, 1, NULL, '2018-07-26 13:52:52', '2018-07-27 04:42:25'),
(23, 'Godminster Vintage Cheddar, Organic (200g)', 'godminster-vintage-cheddar-organic-200g', 4, 1, NULL, '<p class=\"p1\">A rich, strong yet buttery cheese that is delicious on its own, eaten with oatcakes and chutney, or devoured in hunks with an organic apple from your box. It also makes a sinfully good Welsh rarebit on toast. Good Godminster fortune shined down when we came upon one of the best organic mature cheddars we\'ve ever had the pleasure to taste. This one makes the roof of your mouth tingle once you&rsquo;ve liberated it from its handsome, burgundy wax casing. Godminster, that&rsquo;s good!</p>', 84000, 0, 1, 0, NULL, 1, NULL, '2018-07-26 13:53:31', '2018-07-27 04:42:25'),
(24, 'Hake Fillets, pack of 2 (260g)', 'hake-fillets-pack-of-2-260g', 5, 2, NULL, '<p class=\"p1\">Great for a fish pie, hake&rsquo;s firm, sweet, white meat makes it one of our best fish. It&rsquo;s got a medium flake and a milder flavour than cod.&nbsp;</p>\r\n<p class=\"p1\">Our hake comes from both Cornwall and the Irish/North Seas. From Cornwall it will either be gill or fixed netted and have an MCS rating of 1. When caught in the Irish/North Sea, it will be pelagic/demersal otter trawled and have an MCS rating of 2.</p>', 150000, 0, 1, 0, NULL, 1, NULL, '2018-07-26 13:57:08', '2018-07-27 04:42:25'),
(25, 'Mackerel, Fillets (300g)', 'mackerel-fillets-300g', 5, 2, NULL, '<p class=\"p1\">This is beautifully flavourful succulent mackerel. Season them with a sprinkle of salt and pepper and gently sizzle them in a pan with some olive oil. You\'ll want to leave the skin on for that lovely crispness, and it will also hold the fillet together.</p>\r\n<p class=\"p1\">Our mackerel has an MCS rating of 2/3 from Cornish or Scottish waters. Mackerel is mainly caught by handline, but occasionally by drift net or purse seine.</p>', 160000, 0, 1, 0, NULL, 1, NULL, '2018-07-26 13:58:12', '2018-07-27 04:42:25'),
(26, 'Whiting Fillets, pack of 2 (260g)', 'whiting-fillets-pack-of-2-260g', 5, 1, NULL, '<p class=\"p1\">With its sweet, delicate meat, whiting is a real catch, and can make for some of the most stunning fishcakes or fish fingers you&rsquo;ve ever had.&nbsp;</p>\r\n<p class=\"p1\">Our whiting will come from either the Southern Celtic Sea, the English Channel, or Cornwall, and is either Demersal Otter trawled or Seine netted. It will have an MCS rating of 2-3.</p>', 125000, 0, 1, 0, NULL, 1, NULL, '2018-07-26 13:59:21', '2018-07-27 04:42:25'),
(27, 'Hand Dived Scallops (6 pack)', 'hand-dived-scallops-6-pack', 5, 2, 'Beautifully fresh, sweet and meaty scallops. These have, brilliantly, been collected by hand from the seabed, the friendliest way these oceanic treasures can be caught. One of our favourite ways to enjoy them is seared in a hot griddle pan or skillet in some butter (just a few minutes on each side, till they\'re golden), then partner them with some smoky, spicy chorizo or snappy asparagus (or any other green veg will work).', '<p class=\"p1\">Beautifully fresh, sweet and meaty scallops. These have, brilliantly, been collected by hand from the seabed, the friendliest way these oceanic treasures can be caught. One of our favourite ways to enjoy them is seared in a hot griddle pan or skillet in some butter (just a few minutes on each side, till they\'re golden), then partner them with some smoky, spicy chorizo or snappy asparagus (or any other green veg will work).</p>\r\n<p class=\"p1\">Our hand-dived scallop will have an MCS rating of 2-3. Currently caught off the Devon coast and landed in Brixham.</p>', 280000, NULL, 1, 1, NULL, 1, NULL, '2018-07-26 14:00:27', '2018-07-27 03:48:37');

-- --------------------------------------------------------

--
-- Table structure for table `provinces`
--

CREATE TABLE `provinces` (
  `province_id` int(10) NOT NULL,
  `name` varchar(255) DEFAULT NULL,
  `type` varchar(255) DEFAULT NULL,
  `order` int(10) DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `provinces`
--

INSERT INTO `provinces` (`province_id`, `name`, `type`, `order`) VALUES
(1, 'Hà Nội', 'Thành Phố', 2),
(2, 'Hà Giang', 'Tỉnh', 0),
(3, 'Cao Bằng', 'Tỉnh', 0),
(4, 'Bắc Kạn', 'Tỉnh', 0),
(5, 'Tuyên Quang', 'Tỉnh', 0),
(6, 'Lào Cai', 'Tỉnh', 0),
(7, 'Điện Biên', 'Tỉnh', 0),
(8, 'Lai Châu', 'Tỉnh', 0),
(9, 'Sơn La', 'Tỉnh', 0),
(10, 'Yên Bái', 'Tỉnh', 0),
(11, 'Hòa Bình', 'Tỉnh', 0),
(12, 'Thái Nguyên', 'Tỉnh', 0),
(13, 'Lạng Sơn', 'Tỉnh', 0),
(14, 'Quảng Ninh', 'Tỉnh', 0),
(15, 'Bắc Giang', 'Tỉnh', 0),
(16, 'Phú Thọ', 'Tỉnh', 0),
(17, 'Vĩnh Phúc', 'Tỉnh', 0),
(18, 'Bắc Ninh', 'Tỉnh', 0),
(19, 'Hải Dương', 'Tỉnh', 0),
(20, 'Hải Phòng', 'Thành Phố', 0),
(21, 'Hưng Yên', 'Tỉnh', 0),
(22, 'Thái Bình', 'Tỉnh', 0),
(23, 'Hà Nam', 'Tỉnh', 0),
(24, 'Nam Định', 'Tỉnh', 0),
(25, 'Ninh Bình', 'Tỉnh', 0),
(26, 'Thanh Hóa', 'Tỉnh', 0),
(27, 'Nghệ An', 'Tỉnh', 0),
(28, 'Hà Tĩnh', 'Tỉnh', 0),
(29, 'Quảng Bình', 'Tỉnh', 0),
(30, 'Quảng Trị', 'Tỉnh', 0),
(31, 'Thừa Thiên Huế', 'Tỉnh', 0),
(32, 'Đà Nẵng', 'Thành Phố', 0),
(33, 'Quảng Nam', 'Tỉnh', 0),
(34, 'Quảng Ngãi', 'Tỉnh', 0),
(35, 'Bình Định', 'Tỉnh', 0),
(36, 'Phú Yên', 'Tỉnh', 0),
(37, 'Khánh Hòa', 'Tỉnh', 0),
(38, 'Ninh Thuận', 'Tỉnh', 0),
(39, 'Bình Thuận', 'Tỉnh', 0),
(40, 'Kon Tum', 'Tỉnh', 0),
(41, 'Gia Lai', 'Tỉnh', 0),
(42, 'Đắk Lắk', 'Tỉnh', 0),
(43, 'Đắk Nông', 'Tỉnh', 0),
(44, 'Lâm Đồng', 'Tỉnh', 0),
(45, 'Bình Phước', 'Tỉnh', 0),
(46, 'Tây Ninh', 'Tỉnh', 0),
(47, 'Bình Dương', 'Tỉnh', 0),
(48, 'Đồng Nai', 'Tỉnh', 0),
(49, 'Bà Rịa - Vũng Tàu', 'Tỉnh', 0),
(50, 'Hồ Chí Minh', 'Thành Phố', 1),
(51, 'Long An', 'Tỉnh', 0),
(52, 'Tiền Giang', 'Tỉnh', 0),
(53, 'Bến Tre', 'Tỉnh', 0),
(54, 'Trà Vinh', 'Tỉnh', 0),
(55, 'Vĩnh Long', 'Tỉnh', 0),
(56, 'Đồng Tháp', 'Tỉnh', 0),
(57, 'An Giang', 'Tỉnh', 0),
(58, 'Kiên Giang', 'Tỉnh', 0),
(59, 'Cần Thơ', 'Thành Phố', 0),
(60, 'Hậu Giang', 'Tỉnh', 0),
(61, 'Sóc Trăng', 'Tỉnh', 0),
(62, 'Bạc Liêu', 'Tỉnh', 0),
(63, 'Cà Mau', 'Tỉnh', 0);

-- --------------------------------------------------------

--
-- Table structure for table `settings`
--

CREATE TABLE `settings` (
  `setting_id` int(10) NOT NULL,
  `name` varchar(255) DEFAULT NULL,
  `value` varchar(255) DEFAULT NULL,
  `status` tinyint(1) DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Table structure for table `subscribes`
--

CREATE TABLE `subscribes` (
  `subscribe_id` int(10) NOT NULL,
  `email` varchar(255) DEFAULT NULL,
  `status` tinyint(1) NOT NULL DEFAULT '1',
  `deleted_at` datetime DEFAULT NULL,
  `created_at` datetime DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `updated_by` int(10) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `subscribes`
--

INSERT INTO `subscribes` (`subscribe_id`, `email`, `status`, `deleted_at`, `created_at`, `updated_at`, `updated_by`) VALUES
(1, 'adfasdf2@gmail.com', 0, '2018-07-30 15:55:23', '2018-07-30 14:46:42', '2018-07-30 08:55:23', 1),
(2, 'asdf@gmail.com', 1, NULL, '2018-07-30 14:51:23', '2018-07-30 07:51:23', NULL),
(3, 'dfsdf@gmail.com', 1, NULL, '2018-08-01 11:00:37', '2018-08-01 04:00:37', NULL);

-- --------------------------------------------------------

--
-- Table structure for table `suppliers`
--

CREATE TABLE `suppliers` (
  `supplier_id` int(10) NOT NULL,
  `name` varchar(255) DEFAULT NULL,
  `province_id` int(10) DEFAULT NULL,
  `description` varchar(1023) DEFAULT NULL,
  `introduction` text,
  `thumbnail` varchar(255) DEFAULT NULL,
  `status` tinyint(1) DEFAULT '0',
  `deleted_at` datetime DEFAULT NULL,
  `created_at` datetime DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL ON UPDATE CURRENT_TIMESTAMP,
  `created_by` int(10) NOT NULL DEFAULT '0',
  `updated_by` int(10) NOT NULL DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `suppliers`
--

INSERT INTO `suppliers` (`supplier_id`, `name`, `province_id`, `description`, `introduction`, `thumbnail`, `status`, `deleted_at`, `created_at`, `updated_at`, `created_by`, `updated_by`) VALUES
(1, 'Farmers\' Own', 50, '<p class=\"p1\">Farmers\' Own\' comes from a group of innovative Aussie dairy farmers that have come together with Woolworths to bring you this great tasting quality Milk.</p>', '<p class=\"p1\"><strong>Our Background</strong></p>\r\n<p class=\"p2\">The Farmers Own initiative was started back in 2013 with Farmers from the Manning Valley in NSW. The brand began with a trial of just eight local stores within the Manning Valley and 12 Sydney stores in NSW. It\'s success saw the brand expand into VIC, QLD, WA, SA and NT, all the while building direct relationships with Farmers from key provincial areas within these states (Margaret River WA. Otways Regions VIC, Sunshine Coast Hinterland QLD and Barossa Mid North Region SA). In a challenging time for Australian Dairy Farmers, Farmers Own has been a good news story. Check out our packaging to see what our Farmers have to say!</p>\r\n<p class=\"p1\"><strong>Our Deal</strong></p>\r\n<p class=\"p2\">We have direct relationships with our Farmers and not via a processor or a Co-op to ensure they are getting a good deal every time. Our goal is to pay our Farmers a good price for their milk that allows them to continue to produce quality milk. We pick up milk from their farms and transport directly to be processed so we know exactly where the milk comes from that goes into Farmers\' Own milk. Our Farmers are engaged in the branding and feel a sense of belonging to the brand because it is their milk that goes into each bottle. We work with our farmers on sustainable and good animal husbandry practices and our farmers and families are proudly active in promoting Farmers\' Own branded milk in their communities.</p>\r\n<p class=\"p1\"><strong>Awards we\'ve won!</strong></p>\r\n<p class=\"p2\">Since launching, Farmers&rsquo; Own has gone onto win a bunch of Awards within Australian Dairy and Food Competitions listed below:&nbsp;</p>\r\n<ul class=\"ul1\">\r\n<li class=\"li2\">Gold medal at the 2014 Royal Melbourne Fine Food Awards</li>\r\n<li class=\"li2\">Bronze and silver medals in the 2016 Royal Queensland Food and Wine Show</li>\r\n<li class=\"li2\">Gold and Silver at the 2016 DIIA - Dairy Industry Association of Australia Show</li>\r\n<li class=\"li2\">Silver Medal in 2016 the Perth Royal Dairy Show</li>\r\n<li class=\"li2\">Bronze and Silver in the 2016 Royal Queensland Food and Wine Show</li>\r\n</ul>', '/upload/images/suppliers/farmersown-merch-300x380.jpg', 1, NULL, '2018-07-25 16:02:18', '2018-07-26 07:16:50', 1, 1),
(2, 'Gold', 57, '<p class=\"p1\">Gold is a premium range of products that have been specially selected and developed with only the best available ingredients. These products have been developed with celebrating and entertaining in mind. Helping you create magical moments with family and friends.</p>', '<p class=\"p1\">Gold range is so simple, yet impressive. No time to head in store? Shop the range below and get it delivered to your door.</p>', '/upload/images/suppliers/gold-card-300x380dec2016.jpg', 1, NULL, '2018-07-25 16:05:08', '2018-07-25 09:05:08', 1, 0),
(3, 'Woolworths Range', 45, '<p class=\"p1\">Made from the best and passed every customer test</p>\r\n<p class=\"p2\">&nbsp;</p>\r\n<p class=\"p1\">Since June 2015, we have set out to create a healthier food range so you and your family can buy delicious, healthier food at great prices. When you see our green tab on our packs, you know it has been designed by experts, made from the best ingredients and approved by customers just like you.</p>', '<p class=\"p1\"><strong>Aussie producers</strong></p>\r\n<p class=\"p1\">like our growers provided quality ingredients like the Durum wheat in our spaghetti. Aussie farmers provided 100% Australian RSPCA Approved chicken.</p>\r\n<p class=\"p1\"><strong>Our chefs</strong></p>\r\n<p class=\"p1\">picked the best ingredients for their recipes, finessing and improved them based on the reviews each dish received. Soup, salad or pizza &ndash; every recipe was nibbled and quibbled over until it passed with flying colours!</p>\r\n<p class=\"p1\"><strong>Our team of nutritionists</strong></p>\r\n<p class=\"p1\">worked closely with our food developers and chefs to take on the challenge of removing artificial colours and flavours as well as reducing excess salt, sugar and saturated fat without compromising on flavour. The range is also rolling out the Health Star Rating system to help you make healthier choices.</p>\r\n<p class=\"p1\"><strong>Aussie food enthusiasts</strong></p>\r\n<p class=\"p1\">were professionally trained up to taste and critique every product that was being developed. In fact, for products to get the green light they had to pass a blind taste test! We&rsquo;ve also launched Bunch, an online community of customers who&rsquo;ve been invited to try our products and share their thoughts about them in a whole new way, giving us genuine feedback on how we&rsquo;re doing.</p>', '/upload/images/suppliers/wk45-food-range-cards-d.png', 1, NULL, '2018-07-25 16:40:52', '2018-07-25 09:40:52', 1, 0),
(4, 'Voeu', 41, '<p>&nbsp;</p>\r\n<p class=\"p1\">One of life\'s little luxuries, Voeu is something everyone deserves. Simple beauty, inside and out.</p>', '<p class=\"p1\">Voeu skincare includes a range of Anti-Aging Day and Night Creams, Eye Cream and Serum, along with a huge range of skin care must haves like Micellar Water, Facial Gel Wash, Cleansing Facial Wipes and Body Lotions.</p>\r\n<p class=\"p1\">Voeu helps to leave your skin feeling nourished, soothed and hydrated every day. Now luxury skin care isn\'t out of reach.</p>\r\n<p class=\"p1\">Only available at Woolworths.</p>', '/upload/images/suppliers/wk43-apr17-merch-voeu-220x280-v2.jpg', 1, NULL, '2018-07-25 16:44:54', '2018-07-25 09:45:58', 1, 1),
(5, 'Little one\'s', 63, '<p class=\"p1\">Little One&rsquo;s Nappies are designed to help your child stay comfy and happy.<span class=\"Apple-converted-space\">&nbsp;</span></p>', '<p class=\"p1\">With a soft inner lining for increased comfort, a super-stretchy waistband* for freedom of movement and an extra absorbent core to draw moisture away. Little One&rsquo;s will keep your baby comfortably dry.</p>\r\n<p class=\"p1\">Available in a range of sizes from Newborn, Infant, Crawler, Toddler, Walker and Junior, in both Bulk Packs and Convenience Packs. All are unisex, suitable for day and night, and are big on quality yet low on price.</p>\r\n<p class=\"p1\">Our award winning Little One\'s Baby Wipes are enriched with Aloe Vera, Vitamin E and Chamomile extract and are gentle enough for your baby&rsquo;s hands and face. The hypoallergenic formulation is alcohol and soap free, pH balanced and has been dermatologically tested.</p>', '/upload/images/suppliers/wk43-apr17-merch-littleones-220x280-v2.jpg', 1, NULL, '2018-07-25 16:47:09', '2018-07-25 09:47:09', 1, 0);

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `user_id` int(11) NOT NULL,
  `email` varchar(255) DEFAULT NULL,
  `password` varchar(255) DEFAULT NULL,
  `remember_token` varchar(255) DEFAULT NULL,
  `name` varchar(255) DEFAULT NULL,
  `type` varchar(255) DEFAULT NULL,
  `address` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `district_id` int(10) DEFAULT NULL,
  `province_id` int(10) DEFAULT NULL,
  `status` tinyint(1) DEFAULT '0',
  `deleted_at` datetime DEFAULT NULL,
  `created_at` datetime DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL ON UPDATE CURRENT_TIMESTAMP,
  `created_by` int(11) NOT NULL DEFAULT '0',
  `updated_by` int(11) NOT NULL DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`user_id`, `email`, `password`, `remember_token`, `name`, `type`, `address`, `district_id`, `province_id`, `status`, `deleted_at`, `created_at`, `updated_at`, `created_by`, `updated_by`) VALUES
(1, 'thitd@bulk.com', '$2y$10$/MpueH.lyBAIfz.ABwn1iuj5/ltDoO9LDdyxz.jk9InYe4XV2pvEq', 'yTnKpNMNicY1UjoWY2Fq3AlWnQiOJYtcPc1In90ujtapmlBtesBykzjTFMg3', 'Administrator', 'admin', NULL, NULL, NULL, 0, NULL, '2018-07-11 14:23:22', '2018-08-02 02:14:43', 0, 1),
(2, 'restaurant01@gmail.com', '$2y$10$KdOknstQIXtQ0i4N1hv1dO7jzjsCAGcDjrTm6yc0FAGREpk5Wp2Mq', 'OdjrU9m2ykkSKOEr0lIkl9lWsjjeKwkbWJTEpD3ytjdHiq6IFHymrKcm7idn', 'Restaurant 01', 'user', '2 Trần Hưng Đạo', 567, 50, 1, NULL, '2018-07-11 14:23:22', '2018-08-02 06:39:02', 1, 2),
(3, 'restaurant02@gmail.com', '$2y$10$Vey0w75wUy1LxiqbBvcjd.Y/nu43PS5wQI16lcA2Pl/OblHVMzPLm', NULL, 'Restaurant 02', 'user', '123 Trương Định', 554, 50, 1, NULL, '2018-07-11 14:23:22', '2018-07-24 09:45:14', 1, 1),
(4, 'restaurant04@gmail.com', '$2y$10$FiGrsnQe/dSB4/6PwA4zseLwSyEptVgV7EawecNv8nAZ/vmhXmtdu', NULL, 'Restaurant 04', 'user', '2 Trần Hưng Đạo', NULL, NULL, 1, NULL, '2018-07-19 13:31:31', '2018-07-19 06:31:31', 1, 0),
(5, 'admin@bulk.com', '$2y$10$QQBrrDm6p551OZfquu/rA.dcBxGjpHwZA8u4xfFWzBCK3N8XOypPS', NULL, 'Administrator', 'admin', NULL, NULL, NULL, 1, NULL, '2018-07-30 11:50:08', '2018-07-30 04:51:43', 1, 0);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `categories`
--
ALTER TABLE `categories`
  ADD PRIMARY KEY (`category_id`);

--
-- Indexes for table `contacts`
--
ALTER TABLE `contacts`
  ADD PRIMARY KEY (`contact_id`);

--
-- Indexes for table `districts`
--
ALTER TABLE `districts`
  ADD PRIMARY KEY (`district_id`);

--
-- Indexes for table `migrations`
--
ALTER TABLE `migrations`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `orders`
--
ALTER TABLE `orders`
  ADD PRIMARY KEY (`order_id`);

--
-- Indexes for table `order_details`
--
ALTER TABLE `order_details`
  ADD PRIMARY KEY (`order_detail_id`);

--
-- Indexes for table `pictures`
--
ALTER TABLE `pictures`
  ADD PRIMARY KEY (`picture_id`);

--
-- Indexes for table `products`
--
ALTER TABLE `products`
  ADD PRIMARY KEY (`product_id`);

--
-- Indexes for table `provinces`
--
ALTER TABLE `provinces`
  ADD PRIMARY KEY (`province_id`);

--
-- Indexes for table `settings`
--
ALTER TABLE `settings`
  ADD PRIMARY KEY (`setting_id`);

--
-- Indexes for table `subscribes`
--
ALTER TABLE `subscribes`
  ADD PRIMARY KEY (`subscribe_id`);

--
-- Indexes for table `suppliers`
--
ALTER TABLE `suppliers`
  ADD PRIMARY KEY (`supplier_id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`user_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `categories`
--
ALTER TABLE `categories`
  MODIFY `category_id` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT for table `contacts`
--
ALTER TABLE `contacts`
  MODIFY `contact_id` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=14;

--
-- AUTO_INCREMENT for table `districts`
--
ALTER TABLE `districts`
  MODIFY `district_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=698;

--
-- AUTO_INCREMENT for table `migrations`
--
ALTER TABLE `migrations`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `orders`
--
ALTER TABLE `orders`
  MODIFY `order_id` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `order_details`
--
ALTER TABLE `order_details`
  MODIFY `order_detail_id` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `pictures`
--
ALTER TABLE `pictures`
  MODIFY `picture_id` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=59;

--
-- AUTO_INCREMENT for table `products`
--
ALTER TABLE `products`
  MODIFY `product_id` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=28;

--
-- AUTO_INCREMENT for table `provinces`
--
ALTER TABLE `provinces`
  MODIFY `province_id` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=64;

--
-- AUTO_INCREMENT for table `settings`
--
ALTER TABLE `settings`
  MODIFY `setting_id` int(10) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `subscribes`
--
ALTER TABLE `subscribes`
  MODIFY `subscribe_id` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `suppliers`
--
ALTER TABLE `suppliers`
  MODIFY `supplier_id` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `user_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
